window.MATH_ISLAND_QUESTIONS = {
  "multiply": {
    "name": "乘除島",
    "boss": "乘除岩獸",
    "theme": "rock",
    "questions": [
      {
        "type": "fill",
        "prompt": "28個蛋塔，每一直排有4個，可以排成幾排？",
        "answer": "7",
        "explain": "詳解：28÷4＝7",
        "suffix": "排"
      },
      {
        "type": "fill",
        "prompt": "28個蛋塔，每一橫排有7個，可以排成幾排？",
        "answer": "4",
        "explain": "詳解：28÷7＝4",
        "suffix": "排"
      },
      {
        "type": "fill",
        "prompt": "成衣廠做衣服，一件衣服需要6顆扣子，成衣廠做了一些衣服之後，共用了276顆扣子，成衣廠做了多少件衣服？",
        "answer": "46",
        "explain": "詳解：276÷6＝46",
        "suffix": "件"
      },
      {
        "type": "fill",
        "prompt": "柏宇每天存一樣多的錢，存了5天，共存了100元，他一天存多少元？",
        "answer": "20",
        "explain": "詳解：100÷5＝20",
        "suffix": "元"
      },
      {
        "type": "fill",
        "prompt": "一頂帽子價格的4倍剛好和一件360元的上衣一樣，一頂帽子多少元？",
        "answer": "90",
        "explain": "詳解：360÷4＝90",
        "suffix": "元"
      },
      {
        "type": "fill",
        "prompt": "投籃遊戲，投進一球得3分，宥廷投進一些球，共得到36分，他投進幾球？",
        "answer": "12",
        "explain": "詳解：36÷3＝12",
        "suffix": "球"
      },
      {
        "type": "fill",
        "prompt": "一條手鍊要9顆珠子，品妍做了一些手鍊，共用掉135顆珠子，她做了幾條手鍊？",
        "answer": "15",
        "explain": "詳解：135÷9＝15",
        "suffix": "條"
      },
      {
        "type": "fill",
        "prompt": "每個紙箱裝的書都一樣多，書店裝了6個紙箱，共裝了168本，每個紙箱裝了幾本書？",
        "answer": "28",
        "explain": "詳解：168÷6＝28",
        "suffix": "本書"
      },
      {
        "type": "fill",
        "prompt": "羽彤每天存8元，存了幾天後，剛好可以存200元？",
        "answer": "25",
        "explain": "詳解：200÷8＝25",
        "suffix": "天"
      },
      {
        "type": "fill",
        "prompt": "老師把一些色紙平分給4個人，每個人分到12張，老師原來有幾張色紙？",
        "answer": "48",
        "explain": "詳解：12×4＝48",
        "suffix": "張"
      },
      {
        "type": "fill",
        "prompt": "老師準備了一些剪刀，每組分3把，剛好可以分給10組，老師準備了幾把剪刀？",
        "answer": "30",
        "explain": "詳解：3×10＝30",
        "suffix": "把"
      },
      {
        "type": "fill",
        "prompt": "詠安想摺91顆紙星星，如果每天都摺一樣多，一天要摺幾顆，才能剛好7天摺完？",
        "answer": "13",
        "explain": "詳解：91÷7＝13",
        "suffix": "顆"
      },
      {
        "type": "fill",
        "prompt": "恩綺把一條長160公分的緞帶，平分剪成幾段時，每段的長剛好是8公分？",
        "answer": "20",
        "explain": "詳解：160÷8＝20",
        "suffix": "段"
      },
      {
        "type": "fill",
        "prompt": "老闆把做好的捲心酥平分裝成7盒，每盒有18根，剛好裝完，老闆做了幾根捲心酥？",
        "answer": "126",
        "explain": "詳解：18×7＝126",
        "suffix": "根"
      },
      {
        "type": "fill",
        "prompt": "學校大禮堂有135個人，要平分成幾組玩遊戲時，每組會剛好有9個人？",
        "answer": "15",
        "explain": "詳解：135÷9＝15",
        "suffix": "組"
      },
      {
        "type": "fill",
        "prompt": "快樂國小排椅子，每一橫排一樣多，排了8排，一共有296張椅子，每一橫排有幾張椅子？",
        "answer": "37",
        "explain": "詳解：296÷8＝37",
        "suffix": "張"
      },
      {
        "type": "fill",
        "prompt": "玩具店裡，一個玩偶價錢的6倍，剛好和一個450元的機器人一樣，一個玩偶要多少元？",
        "answer": "75",
        "explain": "詳解：450÷6＝75",
        "suffix": "元"
      },
      {
        "type": "fill",
        "prompt": "相簿每頁可以放6張照片，要放幾頁，才可以放滿162張照片？",
        "answer": "27",
        "explain": "詳解：162÷6＝27",
        "suffix": "頁"
      },
      {
        "type": "fill",
        "prompt": "糖果店一枝棒棒糖8元，下午賣掉一些棒棒糖後，共賣了456元，是賣了多少枝棒棒糖？",
        "answer": "57",
        "explain": "詳解：456÷8＝57",
        "suffix": "枝"
      },
      {
        "type": "fill",
        "prompt": "姐姐練習書法，每天用毛筆寫一樣多的字，1星期寫了238個字，姐姐每天寫幾個字？",
        "answer": "34",
        "explain": "詳解：一星期有7天238÷7＝34",
        "suffix": "個"
      },
      {
        "type": "fill",
        "prompt": "一枝筆9元，老師買幾枝筆時，剛好要付297元？",
        "answer": "33",
        "explain": "詳解：297÷9＝33",
        "suffix": "枝"
      },
      {
        "type": "fill",
        "prompt": "一包饅頭72元，一包饅頭的價錢剛好是一瓶發酵乳的6倍，一瓶發酵乳多少元？",
        "answer": "12",
        "explain": "詳解：72÷6＝12",
        "suffix": "元"
      },
      {
        "type": "fill",
        "prompt": "哥哥每天看9頁故事書，幾天可以把一本126頁的故事書看完？",
        "answer": "14",
        "explain": "詳解：126÷9＝14",
        "suffix": "天"
      },
      {
        "type": "fill",
        "prompt": "爸爸發零用錢給3個孩子，每個人都拿到245元，爸爸發了多少元？",
        "answer": "735",
        "explain": "詳解：245×3＝735",
        "suffix": "元"
      },
      {
        "type": "fill",
        "prompt": "健康國小校外教學，所有參加的學生都要搭纜車，每節車廂可以坐8個人，用10節車廂剛好載完，參加的學生有多少個人？",
        "answer": "80",
        "explain": "詳解：8×10＝80",
        "suffix": "個人"
      },
      {
        "type": "fill",
        "prompt": "彥辰有一條長161公分的尼龍繩，平分成幾段時，每一段長剛好是7公分？",
        "answer": "23",
        "explain": "詳解：161÷7＝23",
        "suffix": "段"
      },
      {
        "type": "fill",
        "prompt": "有216瓶運動飲料，每幾瓶裝成一箱時，剛好裝成9箱？",
        "answer": "24",
        "explain": "詳解：216÷9＝24",
        "suffix": "瓶"
      },
      {
        "type": "fill",
        "prompt": "點心店做了一些餅乾，每6片餅乾裝成一包，共裝了10包，點心店做了多少片餅乾？",
        "answer": "60",
        "explain": "詳解：6×10＝60",
        "suffix": "片"
      },
      {
        "type": "fill",
        "prompt": "師傅做了80個蒸餃，每幾個裝一籠時，剛好裝成8籠？",
        "answer": "10",
        "explain": "詳解：80÷8＝10",
        "suffix": "個"
      },
      {
        "type": "fill",
        "prompt": "果園採收了276個水蜜桃，平分裝成幾盒時，每盒剛好有6個水蜜桃？",
        "answer": "46",
        "explain": "詳解：276÷6＝46",
        "suffix": "盒"
      },
      {
        "type": "fill",
        "prompt": "老闆把做好的蛋塔平分裝成8盒，每盒有12個，剛好裝完，老闆做了幾個蛋塔？",
        "answer": "96",
        "explain": "詳解：12×8＝96",
        "suffix": "個"
      },
      {
        "type": "fill",
        "prompt": "哥哥和好朋友共8個人，每個人出一樣多的錢，剛好可以買112元的筆記本送給老師，每個人出了多少元？",
        "answer": "14",
        "explain": "詳解：112÷8＝14",
        "suffix": "元"
      },
      {
        "type": "fill",
        "prompt": "一顆茶葉蛋9元，阿婆賣了幾顆時，剛好賣了378元？",
        "answer": "42",
        "explain": "詳解：378÷9＝42",
        "suffix": "顆"
      },
      {
        "type": "fill",
        "prompt": "有一卷紙膠帶，每9公分剪成一段，共剪了10段，紙膠帶原來有多長？",
        "answer": "90",
        "explain": "詳解：9×10＝90",
        "suffix": "公分"
      },
      {
        "type": "fill",
        "prompt": "老師買了一些巧克力，平分成8袋，每袋有28顆，老師買了幾顆巧克力？",
        "answer": "224",
        "explain": "詳解：28×8＝224",
        "suffix": "顆"
      },
      {
        "type": "fill",
        "prompt": "小蔚有一本126頁的故事書，如果每天看一樣多的頁數，剛好在9天看完，他一天看幾頁？",
        "answer": "14",
        "explain": "詳解：126÷9＝14",
        "suffix": "頁"
      },
      {
        "type": "fill",
        "prompt": "有180顆糖果，平分成幾堆時，每堆剛好會有9顆？",
        "answer": "20",
        "explain": "詳解：180÷9＝20",
        "suffix": "堆"
      },
      {
        "type": "fill",
        "prompt": "點心店做好了一些蛋塔，每16個裝一盒，共裝了8盒，點心店做了多少個蛋塔？",
        "answer": "128",
        "explain": "詳解：16×8＝128",
        "suffix": "個"
      },
      {
        "type": "fill",
        "prompt": "果農把243個蘋果平分裝在幾個盒子裡，每個盒子才會有9個蘋果？",
        "answer": "27",
        "explain": "詳解：243÷9＝27",
        "suffix": "個"
      },
      {
        "type": "fill",
        "prompt": "老師買了7本一樣的年曆，一共付了273元，一本年曆要多少元？",
        "answer": "39",
        "explain": "詳解：273÷7＝39",
        "suffix": "元"
      },
      {
        "type": "fill",
        "prompt": "欣芳每天上學搭公車的車費都一樣多，搭了6天，共花了108元，欣芳一天搭公車花多少元？",
        "answer": "18",
        "explain": "詳解：108÷6＝18",
        "suffix": "元"
      },
      {
        "type": "fill",
        "prompt": "每盒月餅都一樣多，爺爺買了9盒，一共有216個月餅，每盒有幾個月餅？",
        "answer": "24",
        "explain": "詳解：216÷9＝24",
        "suffix": "個"
      },
      {
        "type": "fill",
        "prompt": "放學的路隊每一排人數都一樣多，三年級排了8排，共有336人，每一排有幾人？",
        "answer": "42",
        "explain": "詳解：336÷8＝42",
        "suffix": "人"
      },
      {
        "type": "fill",
        "prompt": "每包色紙有8張，永森買了一些，共有272張，永森買了幾包色紙？",
        "answer": "34",
        "explain": "詳解：272÷8＝34",
        "suffix": "包"
      },
      {
        "type": "fill",
        "prompt": "一箱玉米罐頭有6罐，自助餐老闆買了若干箱，共有750罐，自助餐老闆買了幾箱玉米罐頭？",
        "answer": "125",
        "explain": "詳解：750÷6＝125",
        "suffix": "箱"
      },
      {
        "type": "fill",
        "prompt": "玩一次夾娃娃要付4枚代幣，欣茹玩了幾次後，共付148枚代幣，欣茹共玩了幾次夾娃娃？",
        "answer": "37",
        "explain": "詳解：148÷4＝37",
        "suffix": "次"
      },
      {
        "type": "fill",
        "prompt": "一盒有8顆巧克力，開同樂會時買了若干盒，共買了360顆，同樂會時共買了幾盒巧克力？",
        "answer": "45",
        "explain": "詳解：360÷8＝45",
        "suffix": "盒"
      },
      {
        "type": "fill",
        "prompt": "小珍每天練習寫相同字數的書法，9天共寫了162個字，一天寫幾個字？",
        "answer": "18",
        "explain": "詳解：162÷9＝18",
        "suffix": "個字"
      },
      {
        "type": "fill",
        "prompt": "一件衣服350元，一件衣服的價錢剛好是一雙襪子的7倍，一雙襪子多少元？",
        "answer": "50",
        "explain": "詳解：350÷7＝50",
        "suffix": "元"
      },
      {
        "type": "fill",
        "prompt": "凱文有一些5元硬幣，平分成5堆，每堆有143個硬幣，凱文一共有多少個5元硬幣？",
        "answer": "715",
        "explain": "詳解：143×5＝715",
        "suffix": "個"
      },
      {
        "type": "fill",
        "prompt": "媽媽整理全家人的襪子，把每8雙裝成一盒，剛好可以裝成7盒，全家人共有幾雙襪子？",
        "answer": "56",
        "explain": "詳解：8×7＝56",
        "suffix": "雙"
      },
      {
        "type": "fill",
        "prompt": "饅頭店做了一些饅頭，每9顆放一個蒸籠，剛好放滿8個蒸籠，饅頭店做了幾顆饅頭？",
        "answer": "72",
        "explain": "詳解：9×8＝72",
        "suffix": "顆"
      },
      {
        "type": "fill",
        "prompt": "工廠生產了一些原子筆，平分成7盒，每盒有59枝，工廠生產了幾枝原子筆？",
        "answer": "413",
        "explain": "詳解：59×7＝413",
        "suffix": "枝"
      },
      {
        "type": "fill",
        "prompt": "凱云想摺238顆紙星星，如果每天要摺一樣多，一天要摺幾顆，才能剛好在7天摺完？",
        "answer": "34",
        "explain": "詳解：238÷7＝34",
        "suffix": "顆"
      },
      {
        "type": "fill",
        "prompt": "有136個人要坐遊樂場的小火車，每輛小火車坐的人數都相同，一共坐滿了4輛，每輛小火車坐了幾個人？",
        "answer": "34",
        "explain": "詳解：136÷4＝34",
        "suffix": "個"
      },
      {
        "type": "fill",
        "prompt": "雜貨店有調味粉820公克，每若干公克裝成一包，剛好可以裝成5包，一包裝了幾公克的調味粉？",
        "answer": "164",
        "explain": "詳解：820÷5＝164",
        "suffix": "公克"
      },
      {
        "type": "fill",
        "prompt": "有927顆氣球，每若干顆綁成一束，剛好可以綁成9束，一束綁了幾顆氣球？",
        "answer": "103",
        "explain": "詳解：927÷9＝103",
        "suffix": "顆"
      },
      {
        "type": "fill",
        "prompt": "一袋彈珠有540顆，平分給幾個人時，每個人剛好分到9顆彈珠？",
        "answer": "60",
        "explain": "詳解：540÷9＝60",
        "suffix": "個"
      },
      {
        "type": "fill",
        "prompt": "子越有一些糖果，平分給8個人，每個人可以分到12顆，子越原本有多少顆糖果？",
        "answer": "96",
        "explain": "詳解：12×8＝96",
        "suffix": "顆"
      },
      {
        "type": "fill",
        "prompt": "哥哥每天騎同樣的路線上下班，5天共騎了135公里，一天騎多少公里？(公里是長度單位)",
        "answer": "27",
        "explain": "詳解：( )×5＝135135÷5＝27(公里)",
        "suffix": "公里"
      },
      {
        "type": "fill",
        "prompt": "一顆彈珠8元，堂妹買了一些，付了500元，還不夠36元，堂妹買了多少顆彈珠？",
        "answer": "67",
        "explain": "詳解：500＋36＝5368×( )＝536536÷8＝67(顆)",
        "suffix": "顆"
      },
      {
        "type": "fill",
        "prompt": "伯父買了3條相同款式的皮帶，付了900元，找回57元，一條皮帶要多少元？",
        "answer": "281",
        "explain": "詳解：900－57＝843( )×3＝843843÷3＝281(元)",
        "suffix": "元"
      },
      {
        "type": "fill",
        "prompt": "王伯伯收成了一批橘子，每9顆裝一盒，剛好可以裝滿19盒，沒有剩下。如果每盒少裝3顆，可以多裝滿幾盒？",
        "answer": "9",
        "explain": "詳解：( )÷9＝19，19×9＝1719－3＝6171÷6＝28…328－19＝9",
        "suffix": "盒"
      },
      {
        "type": "choice",
        "prompt": "「12×7＝84→84÷7＝( )」，算式的( )中應該填入什麼數？",
        "choices": [
          "7",
          "8",
          "12",
          "84"
        ],
        "answer": "12",
        "explain": "答案是 12。"
      },
      {
        "type": "choice",
        "prompt": "「72÷8＝9→72÷9＝( )」，算式的( )中應該填入什麼數？",
        "choices": [
          "576",
          "72",
          "9",
          "8"
        ],
        "answer": "8",
        "explain": "答案是 8。"
      },
      {
        "type": "choice",
        "prompt": "老師在黑板上寫下：「221÷17＝13」，利用此算式可以知道221÷13是多少？",
        "choices": [
          "13",
          "17",
          "30",
          "221"
        ],
        "answer": "17",
        "explain": "答案是 17。"
      },
      {
        "type": "choice",
        "prompt": "老師在黑板上寫下：「189÷7＝27」，利用此算式可以知道27×7是多少？",
        "choices": [
          "7",
          "27",
          "189",
          "1323"
        ],
        "answer": "189",
        "explain": "答案是 189。"
      },
      {
        "type": "choice",
        "prompt": "老師在黑板上寫下：「34×15＝510」，利用此算式可以知道510÷34是多少？",
        "choices": [
          "15",
          "34",
          "51",
          "510"
        ],
        "answer": "15",
        "explain": "答案是 15。"
      },
      {
        "type": "choice",
        "prompt": "快樂國小將三年級的學生每25人排成一排，共可以排成18排，若改成每18人排成一排，共可以排成幾排？",
        "choices": [
          "18排",
          "25排",
          "43排",
          "450排"
        ],
        "answer": "25排",
        "explain": "答案是 25排。"
      },
      {
        "type": "choice",
        "prompt": "一箱飲料有12瓶，13箱飲料有156瓶。把156瓶飲料平分裝在13個箱子裡，一個箱子有多少瓶飲料？",
        "choices": [
          "12瓶",
          "13瓶",
          "14瓶",
          "15瓶"
        ],
        "answer": "12瓶",
        "explain": "答案是 12瓶。"
      },
      {
        "type": "choice",
        "prompt": "把一些書平分成9疊，每疊有45本。把這些書重新平分成45疊，每疊有多少本？",
        "choices": [
          "8本",
          "9本",
          "10本",
          "11本"
        ],
        "answer": "9本",
        "explain": "答案是 9本。"
      },
      {
        "type": "choice",
        "prompt": "一盤草莓有8顆，18盤草莓有144顆。把144顆草莓平分裝在8個盤子裡，一個盤子有多少顆草莓？",
        "choices": [
          "8顆",
          "14顆",
          "16顆",
          "18顆"
        ],
        "answer": "18顆",
        "explain": "答案是 18顆。"
      },
      {
        "type": "choice",
        "prompt": "把一些遊戲卡平分成9堆，每堆有26張。把這些遊戲卡平分成26堆，每堆有多少張？",
        "choices": [
          "7張",
          "9張",
          "14張",
          "16張"
        ],
        "answer": "9張",
        "explain": "答案是 9張。"
      },
      {
        "type": "choice",
        "prompt": "甲數乘以4會等於112，那麼甲數會是多少，可以用哪一個算式計算？",
        "choices": [
          "112÷4",
          "4÷112",
          "112×4",
          "4×112"
        ],
        "answer": "112÷4",
        "explain": "答案是 112÷4。"
      },
      {
        "type": "choice",
        "prompt": "甲×4＝124，乙×4＝236，甲和乙哪一個數比較大？",
        "choices": [
          "甲",
          "乙",
          "一樣大",
          "無法判斷"
        ],
        "answer": "乙",
        "explain": "答案是 乙。"
      },
      {
        "type": "choice",
        "prompt": "甲×3＝150，乙×5＝150，甲和乙哪一個數比較大？",
        "choices": [
          "甲",
          "乙",
          "一樣大",
          "無法判斷"
        ],
        "answer": "甲",
        "explain": "答案是 甲。"
      },
      {
        "type": "choice",
        "prompt": "如果A除以6會等於48，那麼A會是多少，可以用哪一個算式計算？",
        "choices": [
          "48÷6",
          "6÷48",
          "48－6",
          "48×6"
        ],
        "answer": "48×6",
        "explain": "答案是 48×6。"
      },
      {
        "type": "choice",
        "prompt": "A÷13＝36，B÷13＝54，A和B哪一個數比較大？",
        "choices": [
          "A",
          "B",
          "一樣大",
          "無法判斷"
        ],
        "answer": "B",
        "explain": "答案是 B。"
      },
      {
        "type": "choice",
        "prompt": "A÷7＝46，B÷9＝46，A和B哪一個數比較大？",
        "choices": [
          "A",
          "B",
          "一樣大",
          "無法判斷"
        ],
        "answer": "B",
        "explain": "答案是 B。"
      },
      {
        "type": "choice",
        "prompt": "已知752＝94×8；752＝188×4；752＝376×2。全臺灣小學運動會，有752位學生參加大會操，在排隊形時，每94位學生排一排，可以排成幾排？",
        "choices": [
          "2排",
          "4排",
          "8排",
          "94排"
        ],
        "answer": "8排",
        "explain": "答案是 8排。"
      },
      {
        "type": "choice",
        "prompt": "已知540＝270×2；540＝108×5；540＝90×6；540＝60×9。全臺灣小學運動會，有540位學生參加大會舞，在排隊形時，每60位學生排一排，可以排成幾排？",
        "choices": [
          "5排",
          "6排",
          "9排",
          "60排"
        ],
        "answer": "9排",
        "explain": "答案是 9排。"
      },
      {
        "type": "choice",
        "prompt": "已知756＝189×4；756＝126×6；756＝108×7；756＝84×9。玉成國小運動會有756位學生參加彩帶舞表演，在排隊形時，每108位學生排一排，可以排成幾排？",
        "choices": [
          "126排",
          "84排",
          "9排",
          "7排"
        ],
        "answer": "7排",
        "explain": "答案是 7排。"
      },
      {
        "type": "choice",
        "prompt": "王伯伯把872顆橘子平分裝在8個箱子裡，每個箱子有109顆橘子。如果改平分裝在109個袋子裡，每個袋子有多少顆橘子？",
        "choices": [
          "6顆",
          "8顆",
          "10顆",
          "12顆"
        ],
        "answer": "8顆",
        "explain": "答案是 8顆。"
      },
      {
        "type": "choice",
        "prompt": "水果店老闆將蘋果每9個裝成一袋，共可以裝成16袋，如果改成每16個裝成一袋，共可以裝成幾袋？",
        "choices": [
          "9袋",
          "16袋",
          "25袋",
          "144袋"
        ],
        "answer": "9袋",
        "explain": "答案是 9袋。"
      },
      {
        "type": "choice",
        "prompt": "老師有174個花片，平分給6組，每組可以分到29個花片，如果再給每組29個花片，老師還需要準備幾個花片？",
        "choices": [
          "6個",
          "29個",
          "35個",
          "174個"
        ],
        "answer": "174個",
        "explain": "答案是 174個。"
      },
      {
        "type": "choice",
        "prompt": "小傑每天存一樣多的錢，8天共存了640元，小傑一天存多少元？",
        "choices": [
          "68元",
          "72元",
          "80元",
          "88元"
        ],
        "answer": "80元",
        "explain": "答案是 80元。"
      },
      {
        "type": "choice",
        "prompt": "正崴每天的零用錢都一樣多，一星期的零用錢是595元，他一天有多少零用錢？",
        "choices": [
          "65元",
          "75元",
          "85元",
          "95元"
        ],
        "answer": "85元",
        "explain": "答案是 85元。"
      },
      {
        "type": "choice",
        "prompt": "甲數乘以4會得到100，那麼甲數是多少？",
        "choices": [
          "24",
          "25",
          "26",
          "28"
        ],
        "answer": "25",
        "explain": "答案是 25。"
      },
      {
        "type": "choice",
        "prompt": "婷婷每天存一樣多的錢，5天共存了560元，婷婷一天存多少元？",
        "choices": [
          "110元",
          "112元",
          "120元",
          "122元"
        ],
        "answer": "112元",
        "explain": "答案是 112元。"
      },
      {
        "type": "choice",
        "prompt": "甲數乘以9會得到729，那麼甲數是多少？",
        "choices": [
          "79",
          "80",
          "81",
          "82"
        ],
        "answer": "81",
        "explain": "答案是 81。"
      },
      {
        "type": "choice",
        "prompt": "甲數的8倍是832，甲數是多少？",
        "choices": [
          "94",
          "99",
          "104",
          "109"
        ],
        "answer": "104",
        "explain": "答案是 104。"
      },
      {
        "type": "choice",
        "prompt": "戊數的7倍是630，戊數是多少？",
        "choices": [
          "70",
          "80",
          "90",
          "100"
        ],
        "answer": "90",
        "explain": "答案是 90。"
      },
      {
        "type": "choice",
        "prompt": "文具店一枝鉛筆特價6元，老師買了一些，共花了132元，老師買了多少枝鉛筆？",
        "choices": [
          "12枝",
          "18枝",
          "22枝",
          "28枝"
        ],
        "answer": "22枝",
        "explain": "答案是 22枝。"
      },
      {
        "type": "choice",
        "prompt": "奇奇想在一星期中存到945元，他平均一天應該存多少元？",
        "choices": [
          "155元",
          "145元",
          "135元",
          "125元"
        ],
        "answer": "135元",
        "explain": "答案是 135元。"
      },
      {
        "type": "choice",
        "prompt": "文具店一塊橡皮擦特價8元，老師買了一些，共花了256元，老師買了多少塊橡皮擦？",
        "choices": [
          "18塊",
          "24塊",
          "32塊",
          "36塊"
        ],
        "answer": "32塊",
        "explain": "詳解：8×( )＝256256÷8＝32(塊)"
      },
      {
        "type": "choice",
        "prompt": "傑瑞想在一星期中存到798元，他平均一天應該存多少元？",
        "choices": [
          "104元",
          "109元",
          "114元",
          "119元"
        ],
        "answer": "114元",
        "explain": "答案是 114元。"
      },
      {
        "type": "choice",
        "prompt": "哥哥每天騎同樣的路線上下班，5天共騎了135公里，一天要騎多少公里？",
        "choices": [
          "25公里",
          "27公里",
          "29公里",
          "31公里"
        ],
        "answer": "27公里",
        "explain": "詳解：( )×5＝135135÷5＝27(公里)"
      },
      {
        "type": "choice",
        "prompt": "乙數除以15會得到4，那麼乙數是多少？",
        "choices": [
          "80",
          "70",
          "60",
          "50"
        ],
        "answer": "60",
        "explain": "答案是 60。"
      },
      {
        "type": "choice",
        "prompt": "曉筠把一包糖果平分給9個人，每個人分到57顆糖果，這包糖果原來有多少顆？",
        "choices": [
          "513顆",
          "671顆",
          "713顆",
          "780顆"
        ],
        "answer": "513顆",
        "explain": "答案是 513顆。"
      },
      {
        "type": "choice",
        "prompt": "乙數除以2會得到442，那麼乙數是多少？",
        "choices": [
          "885",
          "884",
          "883",
          "882"
        ],
        "answer": "884",
        "explain": "答案是 884。"
      },
      {
        "type": "choice",
        "prompt": "丙數除以25會得到7，那麼丙數是多少？",
        "choices": [
          "155",
          "165",
          "175",
          "185"
        ],
        "answer": "175",
        "explain": "答案是 175。"
      },
      {
        "type": "choice",
        "prompt": "哥哥每星期有一些零用錢，平分在7天使用，一天可以用18元，哥哥每星期有零用錢多少元？",
        "choices": [
          "126元",
          "136元",
          "146元",
          "156元"
        ],
        "answer": "126元",
        "explain": "答案是 126元。"
      },
      {
        "type": "choice",
        "prompt": "一條緞帶長480公分，每若干公分剪成一段，剛好可以剪成6段。每多少公分剪成一段？",
        "choices": [
          "60公分",
          "65公分",
          "80公分",
          "88公分"
        ],
        "answer": "80公分",
        "explain": "答案是 80公分。"
      },
      {
        "type": "choice",
        "prompt": "老師將一些糖果平分給8個人，每個人分到9顆，後來又來一位同學，老師將糖果全部收回，再重新平分給每個人，一個人分到多少顆糖果？",
        "choices": [
          "6顆",
          "7顆",
          "8顆",
          "9顆"
        ],
        "answer": "8顆",
        "explain": "答案是 8顆。"
      },
      {
        "type": "choice",
        "prompt": "30÷5＝66×5＝□30÷■＝55×■＝□上面4個算式中的□和■中分別代表一個數。想想看，「□×■」的答案是多少？",
        "choices": [
          "25",
          "36",
          "120",
          "180"
        ],
        "answer": "180",
        "explain": "答案是 180。"
      },
      {
        "type": "choice",
        "prompt": "4乘以一個數，再加上88，會得到548，這個數是多少？",
        "choices": [
          "88",
          "93",
          "115",
          "137"
        ],
        "answer": "115",
        "explain": "詳解：548－88＝460460÷4＝115"
      },
      {
        "type": "choice",
        "prompt": "有一個數乘以5，再加上25，會得到345，這個數是多少？",
        "choices": [
          "54",
          "60",
          "64",
          "74"
        ],
        "answer": "64",
        "explain": "詳解：345－25＝320320÷5＝64"
      },
      {
        "type": "choice",
        "prompt": "5乘以一個數，再加上92，會得到617，這個數是多少？",
        "choices": [
          "105",
          "115",
          "125",
          "135"
        ],
        "answer": "105",
        "explain": "詳解：617－92＝525525÷5＝105"
      },
      {
        "type": "choice",
        "prompt": "甲數的7倍再減掉9是824，甲數是多少？",
        "choices": [
          "19",
          "109",
          "119",
          "1929"
        ],
        "answer": "119",
        "explain": "詳解：824＋9＝833833÷7＝119"
      },
      {
        "type": "choice",
        "prompt": "乙數的5倍再減掉4是951，乙數是多少？",
        "choices": [
          "19",
          "119",
          "191",
          "199"
        ],
        "answer": "191",
        "explain": "詳解：951＋4＝955955÷5＝191"
      },
      {
        "type": "choice",
        "prompt": "丙數的8倍再加上8是600，丙數是多少？",
        "choices": [
          "47",
          "74",
          "80",
          "96"
        ],
        "answer": "74",
        "explain": "詳解：600－8＝592592÷8＝74"
      },
      {
        "type": "choice",
        "prompt": "600比甲數的9倍多6，甲數是多少？",
        "choices": [
          "66",
          "56",
          "46",
          "36"
        ],
        "answer": "66",
        "explain": "詳解：600－6＝594594÷9＝66"
      },
      {
        "type": "choice",
        "prompt": "700比甲數的9倍多7，甲數是多少？",
        "choices": [
          "81",
          "79",
          "77",
          "66"
        ],
        "answer": "77",
        "explain": "詳解：700－7＝693( )×9＝693693÷9＝77"
      },
      {
        "type": "choice",
        "prompt": "爺爺今年70歲，哥哥年齡的7倍多7歲剛好和爺爺的年齡一樣，哥哥今年幾歲？",
        "choices": [
          "9歲",
          "10歲",
          "11歲",
          "12歲"
        ],
        "answer": "9歲",
        "explain": "詳解：70－7＝63( )×7＝6363÷7＝9"
      },
      {
        "type": "choice",
        "prompt": "÷6＝50…2，( )裡的數是多少？",
        "choices": [
          "133",
          "237",
          "302",
          "408"
        ],
        "answer": "302",
        "explain": "詳解：( )÷6＝50…250×6＝300300＋2＝302"
      },
      {
        "type": "choice",
        "prompt": "÷8＝285…7，( )裡的數是多少？",
        "choices": [
          "1995",
          "2003",
          "2287",
          "2880"
        ],
        "answer": "2287",
        "explain": "詳解：( )÷8＝285…7285×8＝22802280＋7＝2287"
      },
      {
        "type": "choice",
        "prompt": "有一個數除以5，得到商是171，餘數是1，這個數是多少？",
        "choices": [
          "857",
          "856",
          "855",
          "854"
        ],
        "answer": "856",
        "explain": "詳解：( )÷5＝171…1171×5＝855855＋1＝856"
      },
      {
        "type": "choice",
        "prompt": "有一個數除以3，得到商是264，餘數是2，這個數是多少？",
        "choices": [
          "497",
          "749",
          "794",
          "974"
        ],
        "answer": "794",
        "explain": "詳解：( )÷3＝264…2264×3＝792792＋2＝794"
      },
      {
        "type": "choice",
        "prompt": "□÷9＝205…5，□裡應該填什麼數？",
        "choices": [
          "1800",
          "1840",
          "1850",
          "1880"
        ],
        "answer": "1850",
        "explain": "詳解：205×9＝18451845＋5＝1850"
      },
      {
        "type": "choice",
        "prompt": "□÷8＝318…6，□裡應該填什麼數？",
        "choices": [
          "2538",
          "2544",
          "2550",
          "2556"
        ],
        "answer": "2550",
        "explain": "詳解：318×8＝25442544＋6＝2550"
      },
      {
        "type": "choice",
        "prompt": "÷7＝136…5，( )裡的數是多少？",
        "choices": [
          "947",
          "952",
          "957",
          "962"
        ],
        "answer": "957",
        "explain": "詳解：( )÷7＝136…5136×7＝952952＋5＝957"
      },
      {
        "type": "choice",
        "prompt": "有一個數除以6，得到的商是119，餘數是2，這個數是多少？",
        "choices": [
          "718",
          "716",
          "714",
          "712"
        ],
        "answer": "716",
        "explain": "詳解：( )÷6＝119…2119×6＝714714＋2＝716"
      },
      {
        "type": "choice",
        "prompt": "有一個數除以4，得到商是198，餘數是1，這個數是多少？",
        "choices": [
          "791",
          "792",
          "793",
          "794"
        ],
        "answer": "793",
        "explain": "詳解：( )÷4＝198…1198×4＝792792＋1＝793"
      },
      {
        "type": "choice",
        "prompt": "759÷□＝6…3，□裡應該填什麼數？",
        "choices": [
          "127",
          "126",
          "125",
          "124"
        ],
        "answer": "126",
        "explain": "詳解：759－3＝756756÷□＝6756÷6＝126"
      },
      {
        "type": "choice",
        "prompt": "÷9＝117…( )，被除數最大會是多少？",
        "choices": [
          "1061",
          "1060",
          "1059",
          "1058"
        ],
        "answer": "1061",
        "explain": "詳解：117×9＝1053被除數是9，所以餘數最大是81053＋8＝1061"
      },
      {
        "type": "choice",
        "prompt": "÷9＝117…( )，被除數不可能是多少？",
        "choices": [
          "1065",
          "1060",
          "1055",
          "1053"
        ],
        "answer": "1065",
        "explain": "詳解：117×9＝1053被除數是9，所以餘數最大是81053＋8＝10611053～1061皆有可能"
      },
      {
        "type": "choice",
        "prompt": "÷8＝96…( )，被除數最小會是多少？",
        "choices": [
          "771",
          "770",
          "769",
          "768"
        ],
        "answer": "768",
        "explain": "詳解：96×8＝768餘數最小為0768＋0＝768"
      },
      {
        "type": "choice",
        "prompt": "÷34＝6…( )，被除數最大會是多少？",
        "choices": [
          "204",
          "210",
          "237",
          "238"
        ],
        "answer": "237",
        "explain": "詳解：34×6＝204被除數是34，所以餘數最大是33204＋33＝237"
      },
      {
        "type": "choice",
        "prompt": "李老闆買進了一批肉乾，每6片裝成一包，剛好可以裝成48包，還剩下4片。如果想要全部裝完沒有剩下，可以改成每幾片裝成一包？",
        "choices": [
          "每6片裝成一包",
          "每5片裝成一包",
          "每4片裝成一包",
          "每3片裝成一包"
        ],
        "answer": "每4片裝成一包",
        "explain": "答案是 每4片裝成一包。"
      },
      {
        "type": "choice",
        "prompt": "宜蓁在做數學題目「( )÷14＝▲…■」，錯把( )裡的十位數字和個位數字看反了，計算出▲是9、■是3，如果沒有其他錯誤，這題( )原本應該是多少？",
        "choices": [
          "129",
          "132",
          "192",
          "195"
        ],
        "answer": "192",
        "explain": "答案是 192。"
      },
      {
        "type": "choice",
        "prompt": "美好水果店一顆柳丁賣6元，阿倫買了一些應該要付270元，老闆優惠再多送給阿倫5顆柳丁，阿倫一共有幾顆柳丁？",
        "choices": [
          "40顆",
          "45顆",
          "50顆",
          "55顆"
        ],
        "answer": "50顆",
        "explain": "詳解：6×( )＝270270÷6＝4545＋5＝50"
      },
      {
        "type": "choice",
        "prompt": "阿姨買了一包棉花糖，每3顆串成一串，剛好可以串成33串，還剩下1顆。如果想要全部串完沒有剩下，可以改成每幾顆串成一串？下面哪一個選項是錯的？",
        "choices": [
          "每4顆串成一串",
          "每5顆串成一串",
          "每6顆串成一串",
          "每2顆串成一串"
        ],
        "answer": "每6顆串成一串",
        "explain": "詳解：( )÷3＝33…1，33×3＝99，99＋1＝100100÷4＝25100÷5＝20100÷6＝16…4100÷2＝50"
      },
      {
        "type": "choice",
        "prompt": "張老闆進了一批糖果，每7顆裝成一包，剛好可以裝成52包，還剩下5顆。如果想要全部裝完沒有剩下，可以改成每幾顆裝成一包？",
        "choices": [
          "每6顆裝成一包",
          "每5顆裝成一包",
          "每4顆裝成一包",
          "每3顆裝成一包"
        ],
        "answer": "每3顆裝成一包",
        "explain": "詳解：( )÷7＝52…5，52×7＝364，364＋5＝369369÷6＝61…3369÷5＝73…4369÷4＝92…1369÷3＝123"
      },
      {
        "type": "choice",
        "prompt": "奶奶今年81歲，姐姐年齡的7倍少3歲剛好和奶奶的年齡一樣，姐姐今年幾歲？",
        "choices": [
          "12歲",
          "13歲",
          "14歲",
          "15歲"
        ],
        "answer": "12歲",
        "explain": "詳解：81＋3＝8484÷7＝12"
      },
      {
        "type": "choice",
        "prompt": "爺爺今年75歲，哥哥年齡的6倍少3歲剛好和爺爺的年齡一樣，哥哥今年幾歲？",
        "choices": [
          "11歲",
          "12歲",
          "13歲",
          "14歲"
        ],
        "answer": "13歲",
        "explain": "詳解：75＋3＝7878÷6＝13"
      },
      {
        "type": "fill",
        "prompt": "4×7＝287×4＝( )28÷4＝( )28÷7＝( )",
        "answer": "28",
        "explain": "答案是 28，7，4。",
        "suffix": "，7，4"
      },
      {
        "type": "fill",
        "prompt": "8×9＝729×8＝( )72÷9＝( )72÷8＝( )",
        "answer": "72",
        "explain": "答案是 72，8，9。",
        "suffix": "，8，9"
      },
      {
        "type": "fill",
        "prompt": "56÷7＝856÷8＝( )7×8＝( )8×7＝( )",
        "answer": "7",
        "explain": "答案是 7，56，56。",
        "suffix": "，56，56"
      },
      {
        "type": "fill",
        "prompt": "42÷7＝( )42÷6＝( )6×7＝( )7×6＝( )",
        "answer": "6",
        "explain": "答案是 6，7，42，42。",
        "suffix": "，7，42，42"
      },
      {
        "type": "fill",
        "prompt": "72×8＝576576÷8＝( )",
        "answer": "72",
        "explain": "答案是 72。"
      },
      {
        "type": "fill",
        "prompt": "267÷3＝8989×3＝( )",
        "answer": "267",
        "explain": "答案是 267。"
      },
      {
        "type": "fill",
        "prompt": "48÷8＝648÷6＝( )",
        "answer": "8",
        "explain": "答案是 8。"
      },
      {
        "type": "fill",
        "prompt": "9×7＝6363÷9＝( )",
        "answer": "7",
        "explain": "答案是 7。"
      },
      {
        "type": "fill",
        "prompt": "126÷7＝1818×7＝( )",
        "answer": "126",
        "explain": "答案是 126。"
      },
      {
        "type": "fill",
        "prompt": "35×6＝210210÷6＝( )",
        "answer": "35",
        "explain": "答案是 35。"
      },
      {
        "type": "fill",
        "prompt": "8×5＝4040÷5＝( )40÷8＝( )",
        "answer": "8",
        "explain": "答案是 8，5。",
        "suffix": "，5"
      },
      {
        "type": "fill",
        "prompt": "14×6＝8484÷6＝( )",
        "answer": "14",
        "explain": "答案是 14。"
      },
      {
        "type": "fill",
        "prompt": "815÷5＝163163×5＝( )",
        "answer": "815",
        "explain": "答案是 815。"
      },
      {
        "type": "fill",
        "prompt": "56÷8＝756÷( )＝87×8＝( )",
        "answer": "7",
        "explain": "答案是 7，56。",
        "suffix": "，56"
      },
      {
        "type": "fill",
        "prompt": "52×7＝364364÷7＝( )",
        "answer": "52",
        "explain": "答案是 52。"
      },
      {
        "type": "fill",
        "prompt": "234÷6＝3939×6＝( )",
        "answer": "234",
        "explain": "答案是 234。"
      },
      {
        "type": "fill",
        "prompt": "校園運動大會，操場上同學們在表演國術，每7人排成一行，共排了21行，一共有147人。現在改成每21人排成一行，共排了7行，一共有多少人？( )人",
        "answer": "147",
        "explain": "答案是 147。"
      },
      {
        "type": "fill",
        "prompt": "7×8＝5656÷7＝( )56÷8＝( )",
        "answer": "8",
        "explain": "答案是 8，7。",
        "suffix": "，7"
      },
      {
        "type": "fill",
        "prompt": "6×5＝3030÷6＝( )30÷5＝( )",
        "answer": "5",
        "explain": "答案是 5，6。",
        "suffix": "，6"
      },
      {
        "type": "fill",
        "prompt": "28÷7＝44×7＝( )28÷4＝( )",
        "answer": "28",
        "explain": "答案是 28，7。",
        "suffix": "，7"
      },
      {
        "type": "fill",
        "prompt": "245÷5＝4949×5＝( )245÷49＝( )",
        "answer": "245",
        "explain": "答案是 245，5。",
        "suffix": "，5"
      },
      {
        "type": "fill",
        "prompt": "232÷8＝29232÷29＝( )29×8＝( )",
        "answer": "8",
        "explain": "答案是 8，232。",
        "suffix": "，232"
      },
      {
        "type": "fill",
        "prompt": "13×5＝6565÷13＝( )65÷5＝( )",
        "answer": "5",
        "explain": "答案是 5，13。",
        "suffix": "，13"
      },
      {
        "type": "fill",
        "prompt": "72÷8＝99×8＝( )72÷9＝( )",
        "answer": "72",
        "explain": "答案是 72，8。",
        "suffix": "，8"
      },
      {
        "type": "fill",
        "prompt": "485÷5＝975×97＝( )485÷97＝( )",
        "answer": "485",
        "explain": "答案是 485，5。",
        "suffix": "，5"
      },
      {
        "type": "fill",
        "prompt": "173×4＝692692÷4＝( )692÷173＝( )",
        "answer": "173",
        "explain": "答案是 173，4。",
        "suffix": "，4"
      },
      {
        "type": "fill",
        "prompt": "105÷7＝1515×7＝( )105÷15＝( )",
        "answer": "105",
        "explain": "答案是 105，7。",
        "suffix": "，7"
      },
      {
        "type": "fill",
        "prompt": "486÷6＝8181×6＝( )486÷81＝( )",
        "answer": "486",
        "explain": "答案是 486，6。",
        "suffix": "，6"
      },
      {
        "type": "fill",
        "prompt": "184×5＝920920÷5＝( )920÷184＝( )",
        "answer": "184",
        "explain": "答案是 184，5。",
        "suffix": "，5"
      },
      {
        "type": "fill",
        "prompt": "872÷8＝109109×8＝( )",
        "answer": "872",
        "explain": "答案是 872。"
      },
      {
        "type": "fill",
        "prompt": "143×5＝715715÷5＝( )",
        "answer": "143",
        "explain": "答案是 143。"
      },
      {
        "type": "fill",
        "prompt": "15×9＝135135÷9＝( )135÷15＝( )",
        "answer": "15",
        "explain": "答案是 15，9。",
        "suffix": "，9"
      },
      {
        "type": "fill",
        "prompt": "657÷9＝7373×9＝( )",
        "answer": "657",
        "explain": "答案是 657。"
      },
      {
        "type": "fill",
        "prompt": "根據算式，填填看。581÷28＝20…21581－21＝( )×( )",
        "answer": "28",
        "explain": "答案是 28，20(答案可互換)。"
      },
      {
        "type": "fill",
        "prompt": "根據算式，填填看。313÷46＝6…37313－37＝( )×( )",
        "answer": "6",
        "explain": "答案是 6，46(答案可互換)。"
      }
    ]
  },
  "decimal": {
    "name": "小數湖",
    "boss": "小數水靈",
    "theme": "lake",
    "questions": [
      {
        "type": "choice",
        "prompt": "把一張色紙平分成10份，其中1份是多少張色紙？",
        "choices": [
          "0.1張色紙",
          "0.2張色紙",
          "0.4張色紙",
          "1張色紙"
        ],
        "answer": "0.1張色紙",
        "explain": "答案是 0.1張色紙。"
      },
      {
        "type": "choice",
        "prompt": "把一張色紙平分成10份，小坡將其中2份塗上顏色，塗色部分是多少張色紙？",
        "choices": [
          "零點五張",
          "零點四張",
          "零點三張",
          "零點二張"
        ],
        "answer": "零點二張",
        "explain": "答案是 零點二張。"
      },
      {
        "type": "choice",
        "prompt": "把一張色紙平分成10份，小奇將其中5份塗上顏色，塗色部分是多少張色紙？",
        "choices": [
          "零點五張",
          "零點四張",
          "零點三張",
          "零點二張"
        ],
        "answer": "零點五張",
        "explain": "答案是 零點五張。"
      },
      {
        "type": "choice",
        "prompt": "7/10公斤的水果，用小數怎麼表示？",
        "choices": [
          "0.4公斤",
          "0.5公斤",
          "0.6公斤",
          "0.7公斤"
        ],
        "answer": "0.7公斤",
        "explain": "答案是 0.7公斤。"
      },
      {
        "type": "choice",
        "prompt": "0.4公斤的水果，用分數怎麼表示？",
        "choices": [
          "4/10公斤",
          "10/14公斤",
          "14/10公斤",
          "10/4公斤"
        ],
        "answer": "4/10公斤",
        "explain": "答案是 4/10公斤。"
      },
      {
        "type": "choice",
        "prompt": "有一條吐司平分成10片，其中的8片是多少條吐司？",
        "choices": [
          "0.5條",
          "0.6條",
          "0.7條",
          "0.8條"
        ],
        "answer": "0.8條",
        "explain": "答案是 0.8條。"
      },
      {
        "type": "choice",
        "prompt": "把一張紙平分成10等分，宇辰將4等分塗上顏色，下面哪一個是塗上顏色張數的正確讀法？",
        "choices": [
          "零點五張",
          "零點四張",
          "零點三張",
          "零點二張"
        ],
        "answer": "零點四張",
        "explain": "答案是 零點四張。"
      },
      {
        "type": "choice",
        "prompt": "小數點後面一位的位置是什麼位值？",
        "choices": [
          "十位",
          "個位",
          "十分位",
          "百分位"
        ],
        "answer": "十分位",
        "explain": "答案是 十分位。"
      },
      {
        "type": "choice",
        "prompt": "4.2是4個1和幾個0.1合起來的？",
        "choices": [
          "1個",
          "2個",
          "3個",
          "4個"
        ],
        "answer": "2個",
        "explain": "答案是 2個。"
      },
      {
        "type": "choice",
        "prompt": "十分位是4，個位是7，十位是6的一位小數是多少？",
        "choices": [
          "47.6",
          "67.4",
          "74.6",
          "76.4"
        ],
        "answer": "67.4",
        "explain": "答案是 67.4。"
      },
      {
        "type": "choice",
        "prompt": "十分位是8，個位是0，十位是3的一位小數是多少？",
        "choices": [
          "3.8",
          "8.3",
          "30.8",
          "80.3"
        ],
        "answer": "30.8",
        "explain": "答案是 30.8。"
      },
      {
        "type": "choice",
        "prompt": "在定位板上，記錄有多少個0.1的位置是什麼位值？",
        "choices": [
          "十位",
          "個位",
          "十分位",
          "百分位"
        ],
        "answer": "十分位",
        "explain": "答案是 十分位。"
      },
      {
        "type": "choice",
        "prompt": "0.5表示有5個多少？",
        "choices": [
          "10",
          "1",
          "0.1",
          "0.01"
        ],
        "answer": "0.1",
        "explain": "答案是 0.1。"
      },
      {
        "type": "choice",
        "prompt": "小美拿了一粒米來量，長約為6毫米，也就是多少公分？",
        "choices": [
          "0.6公分",
          "6公分",
          "16公分",
          "60公分"
        ],
        "answer": "0.6公分",
        "explain": "答案是 0.6公分。"
      },
      {
        "type": "choice",
        "prompt": "小明拿了一粒紅豆來量，長約9毫米，也就是多少公分？",
        "choices": [
          "0.9公分",
          "9公分",
          "19公分",
          "90公分"
        ],
        "answer": "0.9公分",
        "explain": "答案是 0.9公分。"
      },
      {
        "type": "choice",
        "prompt": "有一枝彩色筆長158毫米，也就是多少公分？",
        "choices": [
          "0.158公分",
          "1.58公分",
          "15.8公分",
          "158公分"
        ],
        "answer": "15.8公分",
        "explain": "答案是 15.8公分。"
      },
      {
        "type": "choice",
        "prompt": "16個0.1和10個1合起來是多少？",
        "choices": [
          "2.6",
          "11.6",
          "16.1",
          "26"
        ],
        "answer": "11.6",
        "explain": "答案是 11.6。"
      },
      {
        "type": "choice",
        "prompt": "1等於幾個0.1？",
        "choices": [
          "1個",
          "10個",
          "100個",
          "1000個"
        ],
        "answer": "10個",
        "explain": "答案是 10個。"
      },
      {
        "type": "choice",
        "prompt": "一條橘色積木和10個白色積木一樣長，12個白色積木合起來，和幾條橘色積木一樣長？",
        "choices": [
          "0.2條",
          "1.2條",
          "2條",
          "12條"
        ],
        "answer": "1.2條",
        "explain": "答案是 1.2條。"
      },
      {
        "type": "choice",
        "prompt": "一條橘色積木和10個白色積木一樣長，1.4條橘色積木和多少個白色積木合起來一樣長？",
        "choices": [
          "4個",
          "14個",
          "114個",
          "140個"
        ],
        "answer": "14個",
        "explain": "答案是 14個。"
      },
      {
        "type": "choice",
        "prompt": "一條橘色積木和10個白色積木一樣長，2.6條橘色積木和多少個白色積木合起來一樣長？",
        "choices": [
          "26個",
          "22個",
          "16個",
          "6個"
        ],
        "answer": "26個",
        "explain": "答案是 26個。"
      },
      {
        "type": "choice",
        "prompt": "一條積木平分成10個小積木，27個小積木和多少條積木一樣長？",
        "choices": [
          "2.7條",
          "27條",
          "270條",
          "2700條"
        ],
        "answer": "2.7條",
        "explain": "答案是 2.7條。"
      },
      {
        "type": "choice",
        "prompt": "一個白色積木和0.1條橘色積木一樣長，25個白色積木和多少條橘色積木一樣長？",
        "choices": [
          "0.5條橘色積木",
          "2.5條橘色積木",
          "5條橘色積木",
          "25條橘色積木"
        ],
        "answer": "2.5條橘色積木",
        "explain": "答案是 2.5條橘色積木。"
      },
      {
        "type": "choice",
        "prompt": "一個白色積木和0.1條橘色積木一樣長，1.3條橘色積木和多少個白色積木一樣長？",
        "choices": [
          "0.3個白色積木",
          "1.3個白色積木",
          "3個白色積木",
          "13個白色積木"
        ],
        "answer": "13個白色積木",
        "explain": "答案是 13個白色積木。"
      },
      {
        "type": "choice",
        "prompt": "下面哪一個分數，記成小數後最大？",
        "choices": [
          "4/10",
          "6/10",
          "7/10",
          "9/10"
        ],
        "answer": "9/10",
        "explain": "答案是 9/10。"
      },
      {
        "type": "choice",
        "prompt": "下面哪一個選項錯誤？",
        "choices": [
          "0.3和0.7合起來是1",
          "8個0.1是8",
          "0.6是6個0.1",
          "5個0.1是0.5"
        ],
        "answer": "8個0.1是8",
        "explain": "答案是 8個0.1是8。"
      },
      {
        "type": "choice",
        "prompt": "1個白色積木和0.1條橘色積木一樣長，50個白色積木和多少條橘色積木一樣長？",
        "choices": [
          "0.5條橘色積木",
          "2.5條橘色積木",
          "5條橘色積木",
          "25條橘色積木"
        ],
        "answer": "5條橘色積木",
        "explain": "答案是 5條橘色積木。"
      },
      {
        "type": "choice",
        "prompt": "大家都用相同的杯子喝飲料，誰喝的最多？",
        "choices": [
          "美美喝了1.5杯果汁",
          "小真喝了0.8杯紅茶",
          "芳芳喝了1.7杯咖啡",
          "小寶喝了2.3杯汽水"
        ],
        "answer": "小寶喝了2.3杯汽水",
        "explain": "答案是 小寶喝了2.3杯汽水。"
      },
      {
        "type": "choice",
        "prompt": "下列分數和小數，哪一個數最小？",
        "choices": [
          "0.2",
          "8/10",
          "0.5",
          "7/10"
        ],
        "answer": "0.2",
        "explain": "答案是 0.2。"
      },
      {
        "type": "choice",
        "prompt": "9/10和下面選項中哪兩個小數合起來一樣大？",
        "choices": [
          "0.3＋0.6",
          "0.4＋0.3",
          "0.5＋0.2",
          "0.7＋0.1"
        ],
        "answer": "0.3＋0.6",
        "explain": "答案是 0.3＋0.6。"
      },
      {
        "type": "choice",
        "prompt": "下面哪一個算式的答案和 8/10一樣大？",
        "choices": [
          "0.3＋0.6",
          "0.7＋0.1",
          "0.5＋0.2",
          "0.3＋0.3"
        ],
        "answer": "0.7＋0.1",
        "explain": "答案是 0.7＋0.1。"
      },
      {
        "type": "choice",
        "prompt": "下列選項中，哪一個是錯誤的？",
        "choices": [
          "10－0.3＝0.7",
          "0.3＋0.5＝0.8",
          "0.9－0.1＝0.8",
          "5.2＋4.7＝9.9"
        ],
        "answer": "10－0.3＝0.7",
        "explain": "答案是 10－0.3＝0.7。"
      },
      {
        "type": "choice",
        "prompt": "14毫米也可以說是幾公分？",
        "choices": [
          "1/4公分",
          "4/10公分",
          "1.4公分",
          "14公分"
        ],
        "answer": "1.4公分",
        "explain": "答案是 1.4公分。"
      },
      {
        "type": "choice",
        "prompt": "1個迴紋針長31毫米，一根圖釘長22毫米，兩個接在一起，一共長多少公分？",
        "choices": [
          "530公分",
          "53公分",
          "5.3公分",
          "0.53公分"
        ],
        "answer": "5.3公分",
        "explain": "答案是 5.3公分。"
      },
      {
        "type": "choice",
        "prompt": "160個1毫米，合起來是多少公分？",
        "choices": [
          "160公分",
          "16公分",
          "1.6公分",
          "0.16公分"
        ],
        "answer": "16公分",
        "explain": "答案是 16公分。"
      },
      {
        "type": "choice",
        "prompt": "26毫米也可以說是幾公分？",
        "choices": [
          "6/10公分",
          "2.6公分",
          "26公分",
          "260公分"
        ],
        "answer": "2.6公分",
        "explain": "答案是 2.6公分。"
      },
      {
        "type": "choice",
        "prompt": "180個1毫米，合起來是多少公分？",
        "choices": [
          "0.1公分",
          "0.18公分",
          "1.8公分",
          "18公分"
        ],
        "answer": "18公分",
        "explain": "答案是 18公分。"
      },
      {
        "type": "choice",
        "prompt": "5公分9毫米也可以說是多少公分？",
        "choices": [
          "0.59公分",
          "5.9公分",
          "59公分",
          "590公分"
        ],
        "answer": "5.9公分",
        "explain": "答案是 5.9公分。"
      },
      {
        "type": "choice",
        "prompt": "6公分1毫米也可以說是多少公分？",
        "choices": [
          "610公分",
          "61公分",
          "6.1公分",
          "0.61公分"
        ],
        "answer": "6.1公分",
        "explain": "答案是 6.1公分。"
      },
      {
        "type": "choice",
        "prompt": "甲緞帶長4.8公分，乙緞帶長5.5公分，丙緞帶長54毫米，丁緞帶長63毫米。上面四條緞帶，由長到短排出來，哪一個選項正確？",
        "choices": [
          "丁＞乙＞丙＞甲",
          "乙＞丙＞甲＞丁",
          "乙＞丙＞丁＞甲",
          "丁＞丙＞乙＞甲"
        ],
        "answer": "丁＞乙＞丙＞甲",
        "explain": "詳解：4.8公分＝48毫米5.5公分＝55毫米因為63＞55＞54＞48所以丁＞乙＞丙＞甲"
      },
      {
        "type": "choice",
        "prompt": "下面選項哪一個敘述是錯誤的？",
        "choices": [
          "540毫米＝5.4公分",
          "75毫米＞7公分",
          "80公分＜805毫米",
          "60公分5毫米＞60.2公分"
        ],
        "answer": "540毫米＝5.4公分",
        "explain": "答案是 540毫米＝5.4公分。"
      },
      {
        "type": "choice",
        "prompt": "甲繩長63毫米，乙繩長5.4公分，丙繩長55毫米，丁繩長4.8公分。上面四條繩子，由長到短排出來，哪一個選項是正確的？",
        "choices": [
          "丁＞乙＞丙＞甲",
          "甲＞丙＞乙＞丁",
          "乙＞丙＞丁＞甲",
          "丁＞丙＞乙＞甲"
        ],
        "answer": "甲＞丙＞乙＞丁",
        "explain": "答案是 甲＞丙＞乙＞丁。"
      },
      {
        "type": "choice",
        "prompt": "一個火腿三明治是251.5大卡，一個總匯三明治是369.6大卡，一杯綠茶是48.2大卡，一杯奶茶是238.5大卡，品蓁吃了1個火腿三明治和1杯奶茶，小志吃了1個總匯三明治和1杯綠茶，他們兩人所吃的熱量相差多少大卡？",
        "choices": [
          "72.3大卡",
          "72.2大卡",
          "72大卡",
          "72.4大卡"
        ],
        "answer": "72.2大卡",
        "explain": "答案是 72.2大卡。"
      },
      {
        "type": "choice",
        "prompt": "從西元2013年以來，95無鉛汽油每公升的價格，最高時是36.4元，最低時是西元2020年的17.6元，每公升最高和最低的價格相差多少元？",
        "choices": [
          "188元",
          "21.4元",
          "18.8元",
          "19.8元"
        ],
        "answer": "18.8元",
        "explain": "答案是 18.8元。"
      },
      {
        "type": "choice",
        "prompt": "玉華買了一款削鉛筆機，說明書上方寫適用鉛筆直徑為9mm到12mm，下面哪一個鉛筆的直徑不適合用這款削鉛筆機？",
        "choices": [
          "10毫米",
          "1公分2毫米",
          "0.8公分",
          "1.1公分"
        ],
        "answer": "0.8公分",
        "explain": "答案是 0.8公分。"
      },
      {
        "type": "choice",
        "prompt": "1毫米的降雨量是指單位面積的水深1毫米，降雨強度主要分成三種，小雨是24小時內降雨量小於10毫米，中雨是24小時內降雨量為10到24.9毫米，大雨是24小時內降雨量為25到49.9毫米。下面選項是24小時內的降雨量，哪一個選項是中雨的程度？",
        "choices": [
          "0.9公分",
          "24公分",
          "2公分6毫米",
          "24毫米"
        ],
        "answer": "24毫米",
        "explain": "答案是 24毫米。"
      },
      {
        "type": "fill",
        "prompt": "用小數回答問題。一張紙平分成10份，把10份中的1份塗上顏色，是塗了( )張。",
        "answer": "0.1",
        "explain": "答案是 0.1。"
      },
      {
        "type": "fill",
        "prompt": "用小數回答問題。一張紙平分成10份，把10份中的2份塗上顏色，是塗了( )張。",
        "answer": "0.2",
        "explain": "答案是 0.2。"
      },
      {
        "type": "fill",
        "prompt": "用小數回答問題。一張紙平分成10份，把10份中的3份塗上顏色。塗色的部分是( )張。如果塗4份是( )張；5份是( )張。",
        "answer": "0.3",
        "explain": "答案是 0.3，0.4，0.5。",
        "suffix": "，0.4，0.5"
      },
      {
        "type": "fill",
        "prompt": "4個1和3個0.1合起來是( )。",
        "answer": "4.3",
        "explain": "答案是 4.3。"
      },
      {
        "type": "fill",
        "prompt": "8個1和3個0.1合起來是( )。",
        "answer": "8.3",
        "explain": "答案是 8.3。"
      },
      {
        "type": "fill",
        "prompt": "5.4是( )個1和( )個0.1合起來的。在定位板上記記看。",
        "answer": "5",
        "explain": "答案是 5，4，。",
        "suffix": "，4，"
      },
      {
        "type": "fill",
        "prompt": "10個0.1合起來是( )。",
        "answer": "1.0",
        "explain": "答案是 1.0(或1)。",
        "suffix": "(或1)"
      },
      {
        "type": "fill",
        "prompt": "6個1和3個0.1合起來是( )。",
        "answer": "6.3",
        "explain": "答案是 6.3。"
      },
      {
        "type": "fill",
        "prompt": "兩個杯子一樣大。宥希喝了0.4杯果汁，詠安喝了0.6杯果汁，誰喝的果汁比較多？( )",
        "answer": "詠安",
        "explain": "答案是 詠安。"
      },
      {
        "type": "fill",
        "prompt": "一盒鳳梨酥有10個。甲班吃了2.7盒，乙班吃了3盒，哪一班吃的比較多？( )班",
        "answer": "乙",
        "explain": "答案是 乙。"
      },
      {
        "type": "fill",
        "prompt": "1毫米是幾公分？用分數和小數回答。分數：( )公分小數：( )公分",
        "answer": "1",
        "explain": "答案是 1/10，0.1。",
        "suffix": "/10，0.1"
      },
      {
        "type": "fill",
        "prompt": "2毫米是( )公分，3毫米是( )公分。(用小數回答)",
        "answer": "0.2",
        "explain": "答案是 0.2，0.3。",
        "suffix": "，0.3"
      },
      {
        "type": "fill",
        "prompt": "0.7公分＝( )毫米",
        "answer": "7",
        "explain": "答案是 7。"
      },
      {
        "type": "fill",
        "prompt": "3.4公分＝( )公分( )毫米",
        "answer": "3",
        "explain": "答案是 3，4。",
        "suffix": "，4"
      },
      {
        "type": "fill",
        "prompt": "16毫米＝( )公分(用小數回答)",
        "answer": "1.6",
        "explain": "答案是 1.6。"
      },
      {
        "type": "fill",
        "prompt": "2公分9毫米＝( )公分(用小數回答)",
        "answer": "2.9",
        "explain": "答案是 2.9。"
      },
      {
        "type": "fill",
        "prompt": "5/10用小數表示為( )，0.9用分數表示為( )。",
        "answer": "0.5",
        "explain": "答案是 0.5， 9/10。",
        "suffix": "， 9/10"
      },
      {
        "type": "fill",
        "prompt": "8.5的個位數字是( )，十分位數字是( )。",
        "answer": "8",
        "explain": "答案是 8，5。",
        "suffix": "，5"
      },
      {
        "type": "fill",
        "prompt": "十分位數字是7，個位數字是5的數是( )。",
        "answer": "5.7",
        "explain": "答案是 5.7。"
      },
      {
        "type": "fill",
        "prompt": "6.6的6表示6個1，6表示6個( )。",
        "answer": "0.1",
        "explain": "答案是 0.1。"
      },
      {
        "type": "fill",
        "prompt": "「五點一」的十分位數字是( )，個位數字是( )。",
        "answer": "1",
        "explain": "答案是 1，5。",
        "suffix": "，5"
      },
      {
        "type": "fill",
        "prompt": "20個0.1合起來是( )。",
        "answer": "2",
        "explain": "答案是 2。"
      },
      {
        "type": "fill",
        "prompt": "4.3是( )個0.1合起來的。",
        "answer": "43",
        "explain": "答案是 43。"
      },
      {
        "type": "fill",
        "prompt": "12個1和13個0.1合起來是( )。",
        "answer": "13.3",
        "explain": "答案是 13.3。"
      },
      {
        "type": "fill",
        "prompt": "8.9的個位數字是( )，十分位數字是( )。",
        "answer": "8",
        "explain": "答案是 8，9。",
        "suffix": "，9"
      },
      {
        "type": "fill",
        "prompt": "5.5的5表示5個( )，5表示5個( )。",
        "answer": "1",
        "explain": "答案是 1，0.1。",
        "suffix": "，0.1"
      },
      {
        "type": "fill",
        "prompt": "6公分7毫米＝( )公分",
        "answer": "6.7",
        "explain": "答案是 6.7。"
      },
      {
        "type": "fill",
        "prompt": "9.1公分＝( )公分( )毫米",
        "answer": "9",
        "explain": "答案是 9，1。",
        "suffix": "，1"
      },
      {
        "type": "fill",
        "prompt": "24毫米＝( )公分",
        "answer": "2.4",
        "explain": "答案是 2.4。"
      },
      {
        "type": "fill",
        "prompt": "用小數回答問題。一個披薩平分成10片。1片是( )個披薩；7片是( )個披薩。",
        "answer": "0.1",
        "explain": "答案是 0.1，0.7。",
        "suffix": "，0.7"
      },
      {
        "type": "fill",
        "prompt": "用小數回答問題。一個蔥油餅有10片。3片是( )個蔥油餅；5片是( )個蔥油餅。",
        "answer": "0.3",
        "explain": "答案是 0.3，0.5。",
        "suffix": "，0.5"
      },
      {
        "type": "fill",
        "prompt": "用小數回答問題。小芬把一條緞帶平分成10段。2段是( )條緞帶；8段是( )條緞帶。",
        "answer": "0.2",
        "explain": "答案是 0.2，0.8。",
        "suffix": "，0.8"
      },
      {
        "type": "fill",
        "prompt": "1張蔥油餅平分成10片。8個0.1張蔥油餅合起來是( )張蔥油餅。",
        "answer": "0.8",
        "explain": "答案是 0.8。"
      },
      {
        "type": "fill",
        "prompt": "1條吐司有10片。6個0.1條吐司合起來是( )條吐司。",
        "answer": "0.6",
        "explain": "答案是 0.6。"
      },
      {
        "type": "fill",
        "prompt": "1盒雞蛋有10顆，13個0.1盒雞蛋合起來是( )盒雞蛋。",
        "answer": "1.3",
        "explain": "答案是 1.3。"
      },
      {
        "type": "fill",
        "prompt": "1包餅乾有10片，24個0.1包餅乾合起來是( )包餅乾。",
        "answer": "2.4",
        "explain": "答案是 2.4。"
      },
      {
        "type": "fill",
        "prompt": "6個1和5個0.1合起來是( )。",
        "answer": "6.5",
        "explain": "答案是 6.5。"
      },
      {
        "type": "fill",
        "prompt": "「四點二」寫成小數是( )，這個小數的十分位數字是( )，個位數字是( )。",
        "answer": "4.2",
        "explain": "答案是 4.2，2，4。",
        "suffix": "，2，4"
      },
      {
        "type": "fill",
        "prompt": "十分位數字是7、個位數字是3的小數是( )。",
        "answer": "3.7",
        "explain": "答案是 3.7。"
      },
      {
        "type": "fill",
        "prompt": "十位數字是1、個位數字是5、十分位數字是9的小數是( )。",
        "answer": "15.9",
        "explain": "答案是 15.9。"
      },
      {
        "type": "fill",
        "prompt": "32個0.1合起來是( )。",
        "answer": "3.2",
        "explain": "答案是 3.2。"
      },
      {
        "type": "fill",
        "prompt": "8.9公分＝( )公分( )毫米",
        "answer": "8",
        "explain": "答案是 8，9。",
        "suffix": "，9"
      },
      {
        "type": "fill",
        "prompt": "12公分3毫米＝( )公分",
        "answer": "12.3",
        "explain": "答案是 12.3。"
      },
      {
        "type": "fill",
        "prompt": "一包糖果有10顆，弟弟吃了3顆，用分數記成( )包，用小數記成( )包。",
        "answer": "3",
        "explain": "答案是 3/10，0.3。",
        "suffix": "/10，0.3"
      },
      {
        "type": "fill",
        "prompt": "5/10公斤的櫻桃，用小數記成( )公斤。",
        "answer": "0.5",
        "explain": "答案是 0.5。"
      },
      {
        "type": "fill",
        "prompt": "「0.8」的正確讀法是( )。",
        "answer": "零點八",
        "explain": "答案是 零點八。"
      },
      {
        "type": "fill",
        "prompt": "按照順序寫出一位小數：0.30.4( )0.6( )0.8",
        "answer": "0.5",
        "explain": "答案是 0.5，0.7。",
        "suffix": "，0.7"
      },
      {
        "type": "fill",
        "prompt": "8/10寫成小數是( )。",
        "answer": "0.8",
        "explain": "答案是 0.8。"
      },
      {
        "type": "fill",
        "prompt": "一瓶果汁可以倒滿10杯，安茂喝了4杯，是喝了( )瓶果汁。(用小數回答)",
        "answer": "0.4",
        "explain": "答案是 0.4。"
      },
      {
        "type": "fill",
        "prompt": "把一張色紙平分成10份，其中的1份是( )張色紙。(用小數回答)",
        "answer": "0.1",
        "explain": "答案是 0.1。"
      },
      {
        "type": "fill",
        "prompt": "用小數記記看。 6/10＝( )",
        "answer": "0.6",
        "explain": "答案是 0.6。"
      },
      {
        "type": "fill",
        "prompt": "用小數記記看。 9/10＝( )",
        "answer": "0.9",
        "explain": "答案是 0.9。"
      },
      {
        "type": "fill",
        "prompt": "用分數記記看。0.7＝( )",
        "answer": "7",
        "explain": "答案是 7/10。",
        "suffix": "/10"
      },
      {
        "type": "fill",
        "prompt": "用分數記記看。0.4＝( )",
        "answer": "4",
        "explain": "答案是 4/10。",
        "suffix": "/10"
      },
      {
        "type": "fill",
        "prompt": "十分位是5，個位是9的小數是( )，表示有( )個1和( )個0.1。",
        "answer": "9.5",
        "explain": "答案是 9.5，9，5。",
        "suffix": "，9，5"
      },
      {
        "type": "fill",
        "prompt": "十分位是5，個位數是6，十位數是2的小數是( )。",
        "answer": "26.5",
        "explain": "答案是 26.5。"
      },
      {
        "type": "fill",
        "prompt": "4個1和4個0.1合起來是( )。",
        "answer": "4.4",
        "explain": "答案是 4.4。"
      },
      {
        "type": "fill",
        "prompt": "7.8是7個( )和( )個0.1合起來的。",
        "answer": "1",
        "explain": "答案是 1，8。",
        "suffix": "，8"
      },
      {
        "type": "fill",
        "prompt": "六點四記成小數是( )，這個小數的個位是( )，十分位是( )。",
        "answer": "6.4",
        "explain": "答案是 6.4，6，4。",
        "suffix": "，6，4"
      },
      {
        "type": "fill",
        "prompt": "十分位是2，個位是4的一位小數是( )，表示有( )個1和( )個0.1。",
        "answer": "4.2",
        "explain": "答案是 4.2，4，2。",
        "suffix": "，4，2"
      },
      {
        "type": "fill",
        "prompt": "5.4是( )個1和( )個0.1合起來的。",
        "answer": "5",
        "explain": "答案是 5，4。",
        "suffix": "，4"
      },
      {
        "type": "fill",
        "prompt": "七點一記成小數是( )，這個小數的個位是( )，十分位是( )。",
        "answer": "7.1",
        "explain": "答案是 7.1，7，1。",
        "suffix": "，7，1"
      },
      {
        "type": "fill",
        "prompt": "十分位是3，個位是7的一位小數是( )，表示有( )個1和( )個0.1。",
        "answer": "7.3",
        "explain": "答案是 7.3，7，3。",
        "suffix": "，7，3"
      },
      {
        "type": "fill",
        "prompt": "2.8是( )個1和( )個0.1合起來的。",
        "answer": "2",
        "explain": "答案是 2，8。",
        "suffix": "，8"
      },
      {
        "type": "fill",
        "prompt": "9.3是( )個1和( )個0.1合起來的。",
        "answer": "9",
        "explain": "答案是 9，3。",
        "suffix": "，3"
      },
      {
        "type": "fill",
        "prompt": "九點五記成小數是( )，這個小數的個位是( )，十分位是( )。",
        "answer": "9.5",
        "explain": "答案是 9.5，9，5。",
        "suffix": "，9，5"
      },
      {
        "type": "fill",
        "prompt": "十分位是7，個位是3的一位小數是( )，表示有( )個1和( )個0.1。",
        "answer": "3.7",
        "explain": "答案是 3.7，3，7。",
        "suffix": "，3，7"
      },
      {
        "type": "fill",
        "prompt": "6.5是( )個1和( )個0.1合起來的。",
        "answer": "6",
        "explain": "答案是 6，5。",
        "suffix": "，5"
      },
      {
        "type": "fill",
        "prompt": "4個0.1和9個1合起來是( )。",
        "answer": "9.4",
        "explain": "答案是 9.4。"
      },
      {
        "type": "fill",
        "prompt": "8.4是( )個1和( )個0.1合起來的。",
        "answer": "8",
        "explain": "答案是 8，4。",
        "suffix": "，4"
      },
      {
        "type": "fill",
        "prompt": "7個1和8個0.1合起來是( )。",
        "answer": "7.8",
        "explain": "答案是 7.8。"
      },
      {
        "type": "fill",
        "prompt": "按照順序寫出一位小數：0.60.7( )0.9( )1.1",
        "answer": "0.8",
        "explain": "答案是 0.8，1.0。",
        "suffix": "，1.0"
      },
      {
        "type": "fill",
        "prompt": "在定位板上，記錄有幾個0.1的位置是( )位。",
        "answer": "十分",
        "explain": "答案是 十分。"
      },
      {
        "type": "fill",
        "prompt": "5個1和6個0.1合起來是( )。",
        "answer": "5.6",
        "explain": "答案是 5.6。"
      },
      {
        "type": "fill",
        "prompt": "按照順序寫出一位小數：2.22.1( )1.9( )1.7",
        "answer": "2.0",
        "explain": "答案是 2.0，1.8。",
        "suffix": "，1.8"
      },
      {
        "type": "fill",
        "prompt": "一盒糖果有10顆，5顆糖果和( )盒糖果一樣多。(用小數回答)",
        "answer": "0.5",
        "explain": "答案是 0.5。"
      },
      {
        "type": "fill",
        "prompt": "1個0.1和1個1合起來是( )。",
        "answer": "1.1",
        "explain": "答案是 1.1。"
      },
      {
        "type": "fill",
        "prompt": "6.7是6個( )和( )個0.1合起來的。",
        "answer": "1",
        "explain": "答案是 1，7。",
        "suffix": "，7"
      },
      {
        "type": "fill",
        "prompt": "按照順序寫出一位小數：1.61.5( )1.3( )1.1",
        "answer": "1.4",
        "explain": "答案是 1.4，1.2。",
        "suffix": "，1.2"
      },
      {
        "type": "fill",
        "prompt": "用阿拉伯數字寫寫看。零點八( )",
        "answer": "0.8",
        "explain": "答案是 0.8。"
      },
      {
        "type": "fill",
        "prompt": "用阿拉伯數字寫寫看。零點四( )",
        "answer": "0.4",
        "explain": "答案是 0.4。"
      },
      {
        "type": "fill",
        "prompt": "用阿拉伯數字寫寫看。一點九( )",
        "answer": "1.9",
        "explain": "答案是 1.9。"
      },
      {
        "type": "fill",
        "prompt": "用阿拉伯數字寫寫看。六點三( )",
        "answer": "6.3",
        "explain": "答案是 6.3。"
      },
      {
        "type": "fill",
        "prompt": "8.9中的8表示( )，9表示( )。",
        "answer": "8",
        "explain": "答案是 8，0.9。",
        "suffix": "，0.9"
      },
      {
        "type": "fill",
        "prompt": "6個1毫米合起來是( )毫米，也是( )公分。(用小數回答)",
        "answer": "6",
        "explain": "答案是 6，0.6。",
        "suffix": "，0.6"
      },
      {
        "type": "fill",
        "prompt": "5個1毫米合起來是( )毫米，也是( )公分。(用小數回答)",
        "answer": "5",
        "explain": "答案是 5，0.5。",
        "suffix": "，0.5"
      },
      {
        "type": "fill",
        "prompt": "先用小數回答，再用分數填填看。5毫米＝( )公分＝( )公分",
        "answer": "0.5",
        "explain": "答案是 0.5， 5/10。",
        "suffix": "， 5/10"
      },
      {
        "type": "fill",
        "prompt": "0.1公分＝( )毫米",
        "answer": "1",
        "explain": "答案是 1。"
      },
      {
        "type": "fill",
        "prompt": "0.2公分＝( )毫米",
        "answer": "2",
        "explain": "答案是 2。"
      },
      {
        "type": "fill",
        "prompt": "2.6公分＝( )毫米",
        "answer": "26",
        "explain": "答案是 26。"
      },
      {
        "type": "fill",
        "prompt": "3毫米＝( )公分(用小數回答)",
        "answer": "0.3",
        "explain": "答案是 0.3。"
      },
      {
        "type": "fill",
        "prompt": "217毫米＝( )公分(用小數回答)",
        "answer": "21.7",
        "explain": "答案是 21.7。"
      },
      {
        "type": "fill",
        "prompt": "32公分4毫米＝( )公分(用小數回答)",
        "answer": "32.4",
        "explain": "答案是 32.4。"
      },
      {
        "type": "fill",
        "prompt": "4公分6毫米＝( )公分(用小數回答)",
        "answer": "4.6",
        "explain": "答案是 4.6。"
      },
      {
        "type": "fill",
        "prompt": "10.8公分＝( )毫米",
        "answer": "108",
        "explain": "答案是 108。"
      },
      {
        "type": "fill",
        "prompt": "15毫米＝( )公分",
        "answer": "1.5",
        "explain": "答案是 1.5。"
      },
      {
        "type": "fill",
        "prompt": "518毫米＝( )公分",
        "answer": "51.8",
        "explain": "答案是 51.8。"
      },
      {
        "type": "fill",
        "prompt": "30.9公分＝( )毫米",
        "answer": "309",
        "explain": "答案是 309。"
      },
      {
        "type": "fill",
        "prompt": "2個1和14個0.1合起來是( )。",
        "answer": "3.4",
        "explain": "答案是 3.4。"
      },
      {
        "type": "fill",
        "prompt": "一盒冰棒有10枝。班上同樂會吃掉32枝冰棒，是吃了( )盒冰棒。",
        "answer": "3.2",
        "explain": "答案是 3.2。"
      },
      {
        "type": "fill",
        "prompt": "47個0.1合起來是( )。",
        "answer": "4.7",
        "explain": "答案是 4.7。"
      },
      {
        "type": "fill",
        "prompt": "8個1和12個0.1合起來是( )。",
        "answer": "9.2",
        "explain": "答案是 9.2。"
      },
      {
        "type": "fill",
        "prompt": "1是( )個0.1合起來的。",
        "answer": "10",
        "explain": "答案是 10。"
      },
      {
        "type": "fill",
        "prompt": "3.7是( )個0.1合起來的。",
        "answer": "37",
        "explain": "答案是 37。"
      },
      {
        "type": "fill",
        "prompt": "30個1和10個0.1合起來是( )。",
        "answer": "31",
        "explain": "答案是 31。"
      },
      {
        "type": "fill",
        "prompt": "4個1和17個0.1合起來是( )。",
        "answer": "5.7",
        "explain": "答案是 5.7。"
      },
      {
        "type": "fill",
        "prompt": "0個1和71個0.1合起來是( )。",
        "answer": "7.1",
        "explain": "答案是 7.1。"
      },
      {
        "type": "fill",
        "prompt": "3個1和54個0.1合起來是( )。",
        "answer": "8.4",
        "explain": "答案是 8.4。"
      },
      {
        "type": "fill",
        "prompt": "一瓶果汁可以倒滿10杯，1杯是( )瓶，1.2瓶可以倒滿( )杯。",
        "answer": "0.1",
        "explain": "答案是 0.1，12。",
        "suffix": "，12"
      },
      {
        "type": "fill",
        "prompt": "73個0.1合起來是( )。",
        "answer": "7.3",
        "explain": "答案是 7.3。"
      },
      {
        "type": "fill",
        "prompt": "5是( )個0.1合起來的。",
        "answer": "50",
        "explain": "答案是 50。"
      },
      {
        "type": "fill",
        "prompt": "一桶牛奶全部可以倒滿10杯，1杯是( )桶，1.7桶可以倒滿( )杯。",
        "answer": "0.1",
        "explain": "答案是 0.1，17。",
        "suffix": "，17"
      },
      {
        "type": "fill",
        "prompt": "2個1和15個0.1合起來是( )；這個小數的個位是( )，十分位是( )。",
        "answer": "3.5",
        "explain": "答案是 3.5，3，5。",
        "suffix": "，3，5"
      },
      {
        "type": "fill",
        "prompt": "3個1和17個0.1合起來是( )；這個小數的個位是( )，十分位是( )。",
        "answer": "4.7",
        "explain": "答案是 4.7，4，7。",
        "suffix": "，4，7"
      },
      {
        "type": "fill",
        "prompt": "5.5中的5表示多少？( )5表示多少？( )",
        "answer": "5",
        "explain": "答案是 5，0.5。",
        "suffix": "，0.5"
      },
      {
        "type": "fill",
        "prompt": "77.7中的7表示多少？( )7表示多少？( )7表示多少？( )",
        "answer": "70",
        "explain": "答案是 70，7，0.7。",
        "suffix": "，7，0.7"
      },
      {
        "type": "fill",
        "prompt": "2個1和18個0.1合起來是( )。",
        "answer": "3.8",
        "explain": "答案是 3.8。"
      },
      {
        "type": "fill",
        "prompt": "5個1和26個0.1合起來是( )。",
        "answer": "7.6",
        "explain": "答案是 7.6。"
      },
      {
        "type": "fill",
        "prompt": "15個1和15個0.1合起來是( )。",
        "answer": "16.5",
        "explain": "答案是 16.5。"
      },
      {
        "type": "fill",
        "prompt": "10個1和24個0.1合起來是( )。",
        "answer": "12.4",
        "explain": "答案是 12.4。"
      },
      {
        "type": "fill",
        "prompt": "「八點四」寫成小數是( )，這個小數的個位數字是( )，十分位數字是( )。",
        "answer": "8.4",
        "explain": "答案是 8.4，8，4。",
        "suffix": "，8，4"
      },
      {
        "type": "fill",
        "prompt": "「二十五點一」寫成小數是( )，這個小數的十位數字是( )，十分位數字是( )。",
        "answer": "25.1",
        "explain": "答案是 25.1，2，1。",
        "suffix": "，2，1"
      },
      {
        "type": "fill",
        "prompt": "5個1和14個0.1合起來是( )；這個小數的個位數字是( )，十分位數字是( )。",
        "answer": "6.4",
        "explain": "答案是 6.4，6，4。",
        "suffix": "，6，4"
      },
      {
        "type": "fill",
        "prompt": "兩座山之間有一條寬度是13公尺的河流，想在兩座山之間建一座橋，下面哪些可能是橋的長度？( )甲：12.9公尺乙：13.2公尺丙：14.1公尺",
        "answer": "乙、丙",
        "explain": "答案是 乙、丙。"
      },
      {
        "type": "fill",
        "prompt": "在定位板上記記看，並在□裡填入＞、＜或＝。1.5和0.9",
        "answer": "，＞，",
        "explain": "答案是 ，＞，。"
      },
      {
        "type": "fill",
        "prompt": "在定位板上記記看，並在□裡填入＞、＜或＝。2.7和2.9",
        "answer": "，＜，",
        "explain": "答案是 ，＜，。"
      },
      {
        "type": "fill",
        "prompt": "在定位板上記記看，並在□裡填入＞、＜或＝。0.6和0.2",
        "answer": "，＞，",
        "explain": "答案是 ，＞，。"
      },
      {
        "type": "fill",
        "prompt": "在定位板上記記看，並在□裡填入＞、＜或＝。7.8和8.7",
        "answer": "，＜，",
        "explain": "答案是 ，＜，。"
      },
      {
        "type": "fill",
        "prompt": "哥哥上午喝了0.7瓶水，是喝了( )個0.1瓶，下午又喝了1.3瓶水，是喝了( )個0.1瓶，他今天共喝了( )個0.1瓶，是( )瓶水。",
        "answer": "7",
        "explain": "答案是 7，13，20，2。",
        "suffix": "，13，20，2"
      },
      {
        "type": "fill",
        "prompt": "妹妹上午喝了0.4瓶鮮奶，是喝了( )個0.1瓶，下午又喝了0.3瓶鮮奶，今天妹妹共喝了( )瓶鮮奶。",
        "answer": "4",
        "explain": "答案是 4，0.7。",
        "suffix": "，0.7"
      },
      {
        "type": "fill",
        "prompt": "0.8加2個0.1是( )。",
        "answer": "1",
        "explain": "詳解：0.8＋0.2＝1"
      },
      {
        "type": "fill",
        "prompt": "4/10公分＝( )毫米",
        "answer": "4",
        "explain": "答案是 4。"
      },
      {
        "type": "fill",
        "prompt": "9/10公分＝( )毫米",
        "answer": "9",
        "explain": "答案是 9。"
      },
      {
        "type": "fill",
        "prompt": "如果2.□比2.7小，又比2.2大，那麼□裡的數可能是多少？( )",
        "answer": "3",
        "explain": "詳解：十分位數字大於2、小於7，所以□可能是3、4、5、6",
        "suffix": "、4、5、6"
      },
      {
        "type": "fill",
        "prompt": "如果5.□比5.4大，又比5.9小，那麼□裡的數可能是多少？( )",
        "answer": "5",
        "explain": "詳解：十分位數字大於4、小於9，所以□可能是5、6、7、8",
        "suffix": "、6、7、8"
      },
      {
        "type": "fill",
        "prompt": "比7大，但是比8小的一位小數有幾個？( )個",
        "answer": "9",
        "explain": "詳解：有7.1、7.2、7.3、7.4、7.5、7.6、7.7、7.8、7.9，共9個"
      },
      {
        "type": "fill",
        "prompt": "0.7和( )合起來是1.3。",
        "answer": "0.6",
        "explain": "詳解：1.3－0.7＝0.6"
      },
      {
        "type": "fill",
        "prompt": "一包糖果有30顆，玉珍原來有8個0.1包，送給同學一些後，還剩下5個0.1包，她送給同學( )包糖果。",
        "answer": "0.3",
        "explain": "詳解：0.8－0.5＝0.3(包)"
      },
      {
        "type": "fill",
        "prompt": "2.4公尺比( )公尺多0.9公尺。",
        "answer": "1.5",
        "explain": "詳解：2.4－0.9＝1.5(公尺)"
      },
      {
        "type": "fill",
        "prompt": "比5大，又比8小，十分位數字是3的一位小數有哪些？( )",
        "answer": "5.3",
        "explain": "詳解：十分位數字是3，又介於5和8之間，所以有5.3、6.3、7.3",
        "suffix": "、6.3、7.3"
      },
      {
        "type": "fill",
        "prompt": "□表示相同的數字，3□.2比36.1大，而且23.□比23.8小，那麼□表示的數字可能是多少？( )",
        "answer": "6",
        "explain": "詳解：因為3□.2比36.1大，可以是6、7、8、9，但□要比8小，所以是6、7",
        "suffix": "、7"
      },
      {
        "type": "fill",
        "prompt": "□表示相同的數字(0~9)，32.5＜3□.□＜34.6，那麼□表示的數字可能是多少？( )",
        "answer": "3",
        "explain": "詳解：因為3□.□比32.5大，又比34.6小，所以□是3、4",
        "suffix": "、4"
      },
      {
        "type": "fill",
        "prompt": "□表示相同的數字(0~9)，45.9＜4□.□＜48，那麼□表示的數字可能是多少？( )",
        "answer": "6",
        "explain": "詳解：因為4□.□比45.9大，又比48小，所以□是6、7",
        "suffix": "、7"
      },
      {
        "type": "fill",
        "prompt": "甲、乙、丙、丁四位同學各有一條繩子，根據他們的說法找出四人的繩子各是哪一條？ㄅ繩長14.5公分ㄆ繩長19公分7毫米ㄇ繩長256毫米ㄈ繩長30公分5毫米甲：我的繩子最長。→( )繩乙：我的繩子比20公分長，但比30公分短。→( )繩丙：我的繩子即使長度變成兩倍，還是比最長的繩子短。→( )繩丁：我的繩子是第二短的。→( )繩",
        "answer": "ㄈ，ㄇ，ㄅ，ㄆ",
        "explain": "詳解：ㄅ繩長14公分5毫米、ㄇ繩長25公分6毫米，ㄈ繩長＞ㄇ繩長＞ㄆ繩長＞ㄅ繩長，14.5＋14.5＝29，29公分＜30公分5毫米"
      }
    ]
  },
  "time": {
    "name": "時間塔",
    "boss": "時鐘守衛",
    "theme": "clock",
    "questions": [
      {
        "type": "choice",
        "prompt": "從今天中午12時到明天凌晨0時，一共有幾小時？",
        "choices": [
          "10小時",
          "11小時",
          "12小時",
          "24小時"
        ],
        "answer": "12小時",
        "explain": "答案是 12小時。"
      },
      {
        "type": "choice",
        "prompt": "從今天上午10時到明天上午10時，一共有幾小時？",
        "choices": [
          "10小時",
          "11小時",
          "12小時",
          "24小時"
        ],
        "answer": "24小時",
        "explain": "答案是 24小時。"
      },
      {
        "type": "choice",
        "prompt": "上午11時43分用24時制表示是幾時幾分？",
        "choices": [
          "11時43分",
          "11時13分",
          "21時53分",
          "23時43分"
        ],
        "answer": "11時43分",
        "explain": "答案是 11時43分。"
      },
      {
        "type": "choice",
        "prompt": "15：13是下午幾時幾分？",
        "choices": [
          "1時13分",
          "3時13分",
          "5時13分",
          "15時13分"
        ],
        "answer": "3時13分",
        "explain": "答案是 3時13分。"
      },
      {
        "type": "choice",
        "prompt": "下午8時20分用24時制表示是幾時幾分？",
        "choices": [
          "8時20分",
          "8時32分",
          "18時20分",
          "20時20分"
        ],
        "answer": "20時20分",
        "explain": "答案是 20時20分。"
      },
      {
        "type": "choice",
        "prompt": "下午5時39分用24時制表示是幾時幾分？",
        "choices": [
          "5時39分",
          "10時39分",
          "15時39分",
          "17時39分"
        ],
        "answer": "17時39分",
        "explain": "答案是 17時39分。"
      },
      {
        "type": "choice",
        "prompt": "3：42是上午幾時幾分？",
        "choices": [
          "3時42分",
          "13時42分",
          "15時42分",
          "23時42分"
        ],
        "answer": "3時42分",
        "explain": "答案是 3時42分。"
      },
      {
        "type": "choice",
        "prompt": "19：50是下午幾時幾分？",
        "choices": [
          "7時50分",
          "9時50分",
          "15時50分",
          "19時50分"
        ],
        "answer": "7時50分",
        "explain": "答案是 7時50分。"
      },
      {
        "type": "choice",
        "prompt": "從今天下午9時到明天上午9時，一共有幾小時？",
        "choices": [
          "10小時",
          "11小時",
          "12小時",
          "24小時"
        ],
        "answer": "12小時",
        "explain": "答案是 12小時。"
      },
      {
        "type": "choice",
        "prompt": "從今天上午8時到明天上午8時，一共有幾小時？",
        "choices": [
          "10小時",
          "11小時",
          "12小時",
          "24小時"
        ],
        "answer": "24小時",
        "explain": "答案是 24小時。"
      },
      {
        "type": "choice",
        "prompt": "從今天下午5時到明天上午5時，一共有幾小時？",
        "choices": [
          "10小時",
          "11小時",
          "12小時",
          "24小時"
        ],
        "answer": "12小時",
        "explain": "答案是 12小時。"
      },
      {
        "type": "choice",
        "prompt": "鐘面上有60小格，分針走1小格是多少分鐘？",
        "choices": [
          "1分鐘",
          "5分鐘",
          "30分鐘",
          "60分鐘"
        ],
        "answer": "1分鐘",
        "explain": "答案是 1分鐘。"
      },
      {
        "type": "choice",
        "prompt": "鐘面上有12大格，分針走5圈，時針就走了幾大格？",
        "choices": [
          "1大格",
          "3大格",
          "5大格",
          "7大格"
        ],
        "answer": "5大格",
        "explain": "答案是 5大格。"
      },
      {
        "type": "choice",
        "prompt": "秒針轉一圈，也就是多久？",
        "choices": [
          "1日",
          "1小時",
          "1分鐘",
          "1秒鐘"
        ],
        "answer": "1分鐘",
        "explain": "答案是 1分鐘。"
      },
      {
        "type": "choice",
        "prompt": "分針轉一圈，也就是多久？",
        "choices": [
          "1日",
          "1小時",
          "1分鐘",
          "1秒鐘"
        ],
        "answer": "1小時",
        "explain": "答案是 1小時。"
      },
      {
        "type": "choice",
        "prompt": "100公尺賽跑的時候，用什麼單位來記錄時間比較適合？",
        "choices": [
          "小時",
          "分鐘",
          "秒鐘",
          "都一樣"
        ],
        "answer": "秒鐘",
        "explain": "答案是 秒鐘。"
      },
      {
        "type": "choice",
        "prompt": "鐘面上走動最快的是哪一個指針？",
        "choices": [
          "時針",
          "分針",
          "秒針",
          "一樣快"
        ],
        "answer": "秒針",
        "explain": "答案是 秒針。"
      },
      {
        "type": "choice",
        "prompt": "正年看一部電影，花了1小時25分鐘，這部電影的片長是多少分鐘？",
        "choices": [
          "65分鐘",
          "85分鐘",
          "105分鐘",
          "125分鐘"
        ],
        "answer": "85分鐘",
        "explain": "答案是 85分鐘。"
      },
      {
        "type": "choice",
        "prompt": "8分鐘25秒鐘也就是多少秒鐘？",
        "choices": [
          "825秒鐘",
          "725秒鐘",
          "665秒鐘",
          "505秒鐘"
        ],
        "answer": "505秒鐘",
        "explain": "答案是 505秒鐘。"
      },
      {
        "type": "choice",
        "prompt": "7分鐘52秒鐘也就是多少秒鐘？",
        "choices": [
          "452秒鐘",
          "472秒鐘",
          "612秒鐘",
          "752秒鐘"
        ],
        "answer": "472秒鐘",
        "explain": "答案是 472秒鐘。"
      },
      {
        "type": "choice",
        "prompt": "小奇花了2分鐘18秒鐘才解出一道數學難題，一共是幾秒鐘？",
        "choices": [
          "78秒鐘",
          "138秒鐘",
          "158秒鐘",
          "218秒鐘"
        ],
        "answer": "138秒鐘",
        "explain": "答案是 138秒鐘。"
      },
      {
        "type": "choice",
        "prompt": "下面哪一個 裡面是表示時間？",
        "choices": [
          "媽媽今天17時55分下班",
          "電影在10時30分開始播放",
          "哥哥寫功課花了1小時20分鐘",
          "爸爸到達張伯伯家剛好是10時50分"
        ],
        "answer": "哥哥寫功課花了1小時20分鐘",
        "explain": "答案是 哥哥寫功課花了1小時20分鐘。"
      },
      {
        "type": "choice",
        "prompt": "美如和同學去逛街，共花了5小時，也就是花了多少分鐘？",
        "choices": [
          "240分鐘",
          "300分鐘",
          "420分鐘",
          "500分鐘"
        ],
        "answer": "300分鐘",
        "explain": "答案是 300分鐘。"
      },
      {
        "type": "choice",
        "prompt": "之帆從家裡到動物園，共花了89分鐘，也就是花了幾小時幾分鐘？",
        "choices": [
          "1小時19分鐘",
          "1小時29分鐘",
          "1小時39分鐘",
          "1小時49分鐘"
        ],
        "answer": "1小時29分鐘",
        "explain": "答案是 1小時29分鐘。"
      },
      {
        "type": "choice",
        "prompt": "一天當中，分針要轉幾圈？",
        "choices": [
          "1圈",
          "12圈",
          "24圈",
          "60圈"
        ],
        "answer": "24圈",
        "explain": "答案是 24圈。"
      },
      {
        "type": "choice",
        "prompt": "爸爸搭客運上班花了50分鐘，下班搭客運回家花了1小時，爸爸搭客運上、下班，哪一個花比較多時間？",
        "choices": [
          "上班",
          "下班",
          "一樣多",
          "無法比較"
        ],
        "answer": "下班",
        "explain": "答案是 下班。"
      },
      {
        "type": "choice",
        "prompt": "小智和小安分別拼一幅同樣的拼圖，小智花了2小時3分鐘拼完，小安花了93分鐘拼完，兩個人誰比較快拼完？",
        "choices": [
          "小安",
          "小智",
          "一樣快",
          "不能比較"
        ],
        "answer": "小安",
        "explain": "答案是 小安。"
      },
      {
        "type": "choice",
        "prompt": "樂曲「海洋之歌」和「四季頌」分別長4分鐘57秒鐘和395秒鐘，哪一首樂曲的播放時間比較久？",
        "choices": [
          "海洋之歌",
          "四季頌",
          "一樣久",
          "不能比較"
        ],
        "answer": "四季頌",
        "explain": "答案是 四季頌。"
      },
      {
        "type": "choice",
        "prompt": "自強參加餃子大胃王比賽，大會規定在5分鐘10秒鐘內吃完30個，才能晉級，自強花了315秒鐘吃了30個，他可以晉級嗎？",
        "choices": [
          "可以",
          "不可以",
          "不能比較",
          "不確定"
        ],
        "answer": "不可以",
        "explain": "答案是 不可以。"
      },
      {
        "type": "choice",
        "prompt": "下圖是從桃園中正國際機場飛往東京、首爾和曼谷所需的飛航時間，飛往首爾和曼谷，哪一個的飛航時間比較長？",
        "choices": [
          "曼谷",
          "首爾",
          "一樣長",
          "不能比較"
        ],
        "answer": "曼谷",
        "explain": "答案是 曼谷。"
      },
      {
        "type": "choice",
        "prompt": "月茗從下午1時8分開始睡午覺，共睡了45分鐘，醒來時是下午幾時幾分？",
        "choices": [
          "下午12時23分",
          "下午12時53分",
          "下午1時23分",
          "下午1時53分"
        ],
        "answer": "下午1時53分",
        "explain": "答案是 下午1時53分。"
      },
      {
        "type": "choice",
        "prompt": "從桃園國際機場飛往曼谷所需的飛行時間是210分鐘，爸爸從桃園前往曼谷，如果已經飛了3小時10分鐘，還要幾分鐘才會到達？",
        "choices": [
          "15分鐘",
          "20分鐘",
          "30分鐘",
          "35分鐘"
        ],
        "answer": "20分鐘",
        "explain": "詳解：3小時10分鐘＝190分鐘210分鐘－190分鐘＝20分鐘"
      },
      {
        "type": "choice",
        "prompt": "大地遊戲「步步驚魂」，每位挑戰者有400秒鐘的闖關時間。偉君已經用了5分鐘12秒鐘，他還有多少秒鐘可以闖關？",
        "choices": [
          "188秒鐘",
          "112秒鐘",
          "100秒鐘",
          "88秒鐘"
        ],
        "answer": "88秒鐘",
        "explain": "答案是 88秒鐘。"
      },
      {
        "type": "choice",
        "prompt": "為了保持廁所乾燥，媽媽洗完澡後會按下浴室抽風機的按鈕，讓抽風機運轉150分鐘，今天下午10時45分抽風機剛好停止，媽媽是下午幾時幾分按下抽風機？",
        "choices": [
          "下午7時15分",
          "下午8時15分",
          "下午8時45分",
          "上午8時15分"
        ],
        "answer": "下午8時15分",
        "explain": "答案是 下午8時15分。"
      },
      {
        "type": "choice",
        "prompt": "爸爸上午8時5分從家裡出門，先騎機車，騎了12分鐘到捷運站，再搭捷運搭了35分鐘，出捷運站後，要再走路5分鐘才到公司，爸爸到公司是什麼時候？他上班時間是上午9時，有遲到嗎？",
        "choices": [
          "上午8時57分，有遲到",
          "上午8時58分，有遲到",
          "上午8時57分，沒有遲到",
          "上午8時58分，沒有遲到"
        ],
        "answer": "上午8時57分，沒有遲到",
        "explain": "答案是 上午8時57分，沒有遲到。"
      },
      {
        "type": "choice",
        "prompt": "芬華從上午11時46分開始看球賽轉播，到14時46分結束，她一共看了多少時間？",
        "choices": [
          "2小時",
          "3小時",
          "4小時",
          "5小時"
        ],
        "answer": "3小時",
        "explain": "答案是 3小時。"
      },
      {
        "type": "choice",
        "prompt": "從今天上午3時到明天上午2時，一共有幾小時？",
        "choices": [
          "10小時",
          "11小時",
          "23小時",
          "24小時"
        ],
        "answer": "23小時",
        "explain": "答案是 23小時。"
      },
      {
        "type": "choice",
        "prompt": "下表為臺北市立體育場體育設施開放時刻表，網球場每天的開放時間，一共是多少小時？",
        "choices": [
          "15小時",
          "16小時",
          "17小時",
          "18小時"
        ],
        "answer": "17小時",
        "explain": "答案是 17小時。"
      },
      {
        "type": "choice",
        "prompt": "小廣要搭16：58的火車，從家裡到車站要花23分鐘，如果他想提早半小時到達車站，他最晚應該下午幾時幾分要從家裡出發？",
        "choices": [
          "下午6時28分",
          "下午6時5分",
          "下午4時5分",
          "下午3時35分"
        ],
        "answer": "下午4時5分",
        "explain": "詳解：16：58是下午4時58分4時58分－30分＝4時28分4時28分－23分＝4時5分"
      },
      {
        "type": "choice",
        "prompt": "爸爸從臺北開車到新竹用了146分鐘，也可以說是幾小時幾分鐘？",
        "choices": [
          "1小時26分鐘",
          "1小時46分鐘",
          "2小時26分鐘",
          "2小時46分鐘"
        ],
        "answer": "2小時26分鐘",
        "explain": "詳解：146－60＝86，86－60＝26"
      },
      {
        "type": "choice",
        "prompt": "姐姐和同學講電話，一共講了500秒鐘，是幾分鐘幾秒鐘？",
        "choices": [
          "8分鐘40秒鐘",
          "8分鐘30秒鐘",
          "8分鐘20秒鐘",
          "8分鐘10秒鐘"
        ],
        "answer": "8分鐘20秒鐘",
        "explain": "詳解：60×8＝480500－480＝20"
      },
      {
        "type": "choice",
        "prompt": "表哥從桃園開車到基隆花了115分鐘，也可以說是幾小時幾分鐘？",
        "choices": [
          "1小時15分鐘",
          "1小時55分鐘",
          "2小時15分鐘",
          "2小時55分鐘"
        ],
        "answer": "1小時55分鐘",
        "explain": "詳解：115－60＝55"
      },
      {
        "type": "choice",
        "prompt": "下面是從桃園國際機場飛往各城市所需的飛航時間，到哪一個城市的飛航時間最長？東京：225分鐘首爾：3小時25分鐘曼谷：210分鐘",
        "choices": [
          "東京",
          "首爾",
          "曼谷",
          "都一樣長"
        ],
        "answer": "東京",
        "explain": "詳解：3小時25分鐘＝205分鐘225分鐘＞210分鐘＞205分鐘"
      },
      {
        "type": "choice",
        "prompt": "姐姐從下午2時20分開始做緞帶花，做到下午3時50分才休息，如果每10分鐘做3朵，姐姐共做了多少朵緞帶花？",
        "choices": [
          "10朵",
          "27朵",
          "30朵",
          "90朵"
        ],
        "answer": "27朵",
        "explain": "詳解：3時50分－2時20分＝1時30分1小時30分鐘＝90分鐘90÷10＝9，3×9＝27"
      },
      {
        "type": "fill",
        "prompt": "今天凌晨0時到中午12時，有( )小時，時針轉了( )圈。",
        "answer": "12",
        "explain": "答案是 12，1。",
        "suffix": "，1"
      },
      {
        "type": "fill",
        "prompt": "中午12時到明天凌晨0時，有( )小時，時針轉了( )圈。",
        "answer": "12",
        "explain": "答案是 12，1。",
        "suffix": "，1"
      },
      {
        "type": "fill",
        "prompt": "一天有( )小時，時針轉了( )圈。",
        "answer": "24",
        "explain": "答案是 24，2。",
        "suffix": "，2"
      },
      {
        "type": "fill",
        "prompt": "從今天上午7時，到明天上午7時，一共經過( )小時，也可以說是( )日。",
        "answer": "24",
        "explain": "答案是 24，1。",
        "suffix": "，1"
      },
      {
        "type": "fill",
        "prompt": "「下午1時」用24時制記成( )。",
        "answer": "13",
        "explain": "答案是 13時(或13：00)。"
      },
      {
        "type": "fill",
        "prompt": "「20時」用12時制記成( )。",
        "answer": "下午8時",
        "explain": "答案是 下午8時。"
      },
      {
        "type": "fill",
        "prompt": "15：30是( )午( )時( )分。",
        "answer": "下，3，30",
        "explain": "答案是 下，3，30。"
      },
      {
        "type": "fill",
        "prompt": "下午9時27分用24時制表示為( )時( )分。",
        "answer": "21",
        "explain": "答案是 21，27。",
        "suffix": "，27"
      },
      {
        "type": "fill",
        "prompt": "卡通節目從下午5時開始播放，到下午6時結束，共播了( )分鐘。",
        "answer": "60",
        "explain": "答案是 60。"
      },
      {
        "type": "fill",
        "prompt": "秒針走一圈，共走了( )小格，是( )秒鐘。",
        "answer": "60",
        "explain": "答案是 60，60。",
        "suffix": "，60"
      },
      {
        "type": "fill",
        "prompt": "秒針走一圈，分針走了( )小格。",
        "answer": "1",
        "explain": "答案是 1。"
      },
      {
        "type": "fill",
        "prompt": "60秒鐘和1分鐘一樣久嗎？( )",
        "answer": "一樣久",
        "explain": "答案是 一樣久。"
      },
      {
        "type": "fill",
        "prompt": "1日＝( )小時；1小時＝( )分鐘；1分鐘＝( )秒鐘。",
        "answer": "24",
        "explain": "答案是 24，60，60。",
        "suffix": "，60，60"
      },
      {
        "type": "fill",
        "prompt": "現在是13：56，再過4分鐘，是下午( )時( )分。",
        "answer": "2",
        "explain": "答案是 2，0。",
        "suffix": "，0"
      },
      {
        "type": "fill",
        "prompt": "6分鐘10秒鐘＝( )秒鐘",
        "answer": "370",
        "explain": "答案是 370。"
      },
      {
        "type": "fill",
        "prompt": "4小時25分鐘＝( )分鐘",
        "answer": "265",
        "explain": "答案是 265。"
      },
      {
        "type": "fill",
        "prompt": "下午2時用24時制表示是( )：( )。",
        "answer": "14",
        "explain": "答案是 14，00。",
        "suffix": "，00"
      },
      {
        "type": "fill",
        "prompt": "10：00是( )午( )時。",
        "answer": "上，10",
        "explain": "答案是 上，10。"
      },
      {
        "type": "fill",
        "prompt": "18：56是( )午( )時( )分。",
        "answer": "下，6，56",
        "explain": "答案是 下，6，56。"
      },
      {
        "type": "fill",
        "prompt": "上午6時24分用24時制表示是( )：( )。",
        "answer": "6",
        "explain": "答案是 6，24。",
        "suffix": "，24"
      },
      {
        "type": "fill",
        "prompt": "下午5時31分用24時制表示是( )：( )。",
        "answer": "17",
        "explain": "答案是 17，31。",
        "suffix": "，31"
      },
      {
        "type": "fill",
        "prompt": "下午3時9分用24時制表示為( )時( )分。",
        "answer": "15",
        "explain": "答案是 15，9。",
        "suffix": "，9"
      },
      {
        "type": "fill",
        "prompt": "宇翔家開車去動物園玩，花2小時10分鐘，也可以說是( )分鐘。",
        "answer": "130",
        "explain": "答案是 130。"
      },
      {
        "type": "fill",
        "prompt": "地震紀錄片播了2小時28分鐘，也可以說是( )分鐘。",
        "answer": "148",
        "explain": "答案是 148。"
      },
      {
        "type": "fill",
        "prompt": "秒針走1小格是( )秒鐘，走1圈是走了( )小格，是( )秒鐘，也可以說是( )分鐘。",
        "answer": "1",
        "explain": "答案是 1，60，60，1。",
        "suffix": "，60，60，1"
      },
      {
        "type": "fill",
        "prompt": "秒針走2圈，分針會走( )小格，也可以說是( )分鐘。",
        "answer": "2",
        "explain": "答案是 2，2。",
        "suffix": "，2"
      },
      {
        "type": "fill",
        "prompt": "阿姨參加馬拉松路跑，跑了3小時47分鐘，也可以說是( )分鐘。",
        "answer": "227",
        "explain": "答案是 227。"
      },
      {
        "type": "fill",
        "prompt": "卡通的預告片播了2分鐘15秒鐘，也可以說是( )秒鐘。",
        "answer": "135",
        "explain": "答案是 135。"
      },
      {
        "type": "fill",
        "prompt": "18時用12時制表示是( )午( )時。",
        "answer": "下，6",
        "explain": "答案是 下，6。"
      },
      {
        "type": "fill",
        "prompt": "11時用12時制表示是( )午( )時。",
        "answer": "上，11",
        "explain": "答案是 上，11。"
      },
      {
        "type": "fill",
        "prompt": "上午8時用24時制表示是( )時。",
        "answer": "8",
        "explain": "答案是 8。"
      },
      {
        "type": "fill",
        "prompt": "下午11時用24時制表示是( )時。",
        "answer": "23",
        "explain": "答案是 23。"
      },
      {
        "type": "fill",
        "prompt": "15：56是( )午( )時( )分。",
        "answer": "下，3，56",
        "explain": "答案是 下，3，56。"
      },
      {
        "type": "fill",
        "prompt": "17：24是( )午( )時( )分。",
        "answer": "下，5，24",
        "explain": "答案是 下，5，24。"
      },
      {
        "type": "fill",
        "prompt": "下午9時15分用24時制表示為( )時( )分。",
        "answer": "21",
        "explain": "答案是 21，15。",
        "suffix": "，15"
      },
      {
        "type": "fill",
        "prompt": "3分鐘24秒鐘＝( )秒鐘",
        "answer": "204",
        "explain": "答案是 204。"
      },
      {
        "type": "fill",
        "prompt": "1分鐘16秒鐘＝( )秒鐘",
        "answer": "76",
        "explain": "答案是 76。"
      },
      {
        "type": "fill",
        "prompt": "2分鐘33秒鐘＝( )秒鐘",
        "answer": "153",
        "explain": "答案是 153。"
      },
      {
        "type": "fill",
        "prompt": "5分鐘59秒鐘＝( )秒鐘",
        "answer": "359",
        "explain": "答案是 359。"
      },
      {
        "type": "fill",
        "prompt": "8小時也可以說是( )分鐘。",
        "answer": "480",
        "explain": "答案是 480。"
      },
      {
        "type": "fill",
        "prompt": "美寶看故事書花了2小時28分鐘，也可以說是花了( )分鐘。",
        "answer": "148",
        "explain": "答案是 148。"
      },
      {
        "type": "fill",
        "prompt": "玉珮游泳100公尺花了3分鐘5秒鐘，也可以說是( )秒鐘。",
        "answer": "185",
        "explain": "答案是 185。"
      },
      {
        "type": "fill",
        "prompt": "一天有( )小時。",
        "answer": "24",
        "explain": "答案是 24。"
      },
      {
        "type": "fill",
        "prompt": "下午6時49分用24時制表示是( )時( )分。",
        "answer": "18",
        "explain": "答案是 18，49。",
        "suffix": "，49"
      },
      {
        "type": "fill",
        "prompt": "下午10時36分用24時制表示是( )時( )分。",
        "answer": "22",
        "explain": "答案是 22，36。",
        "suffix": "，36"
      },
      {
        "type": "fill",
        "prompt": "2小時45分鐘＝( )分鐘",
        "answer": "165",
        "explain": "答案是 165。"
      },
      {
        "type": "fill",
        "prompt": "3小時27分鐘＝( )分鐘",
        "answer": "207",
        "explain": "答案是 207。"
      },
      {
        "type": "fill",
        "prompt": "6小時18分鐘＝( )分鐘",
        "answer": "378",
        "explain": "答案是 378。"
      },
      {
        "type": "fill",
        "prompt": "8小時16分鐘＝( )分鐘",
        "answer": "496",
        "explain": "答案是 496。"
      },
      {
        "type": "fill",
        "prompt": "1小時3分鐘＝( )分鐘",
        "answer": "63",
        "explain": "答案是 63。"
      },
      {
        "type": "fill",
        "prompt": "3小時23分鐘＝( )分鐘",
        "answer": "203",
        "explain": "答案是 203。"
      },
      {
        "type": "fill",
        "prompt": "2分鐘40秒鐘＝( )秒鐘",
        "answer": "160",
        "explain": "答案是 160。"
      },
      {
        "type": "fill",
        "prompt": "2分鐘32秒鐘＝( )秒鐘",
        "answer": "152",
        "explain": "答案是 152。"
      },
      {
        "type": "fill",
        "prompt": "晚上8時用24時制表示是( )時。",
        "answer": "20",
        "explain": "答案是 20。"
      },
      {
        "type": "fill",
        "prompt": "上午10時47分用24時制表示是( )時( )分。",
        "answer": "10",
        "explain": "答案是 10，47。",
        "suffix": "，47"
      },
      {
        "type": "fill",
        "prompt": "20：35是下午( )時( )分。",
        "answer": "8",
        "explain": "答案是 8，35。",
        "suffix": "，35"
      },
      {
        "type": "fill",
        "prompt": "1天有( )小時，時針1天會轉( )圈。",
        "answer": "24",
        "explain": "答案是 24，2。",
        "suffix": "，2"
      },
      {
        "type": "fill",
        "prompt": "至德看了一部電影，花了1小時35分鐘，這部電影的片長是( )分鐘。",
        "answer": "95",
        "explain": "答案是 95。"
      },
      {
        "type": "fill",
        "prompt": "育玲從家裡到圖書館，共花了66分鐘，也就是花了( )小時( )分鐘。",
        "answer": "1",
        "explain": "答案是 1，6。",
        "suffix": "，6"
      },
      {
        "type": "fill",
        "prompt": "小燕摺一隻紙鶴要花1分鐘12秒鐘，也可以說是( )秒鐘。",
        "answer": "72",
        "explain": "答案是 72。"
      },
      {
        "type": "fill",
        "prompt": "2分鐘18秒鐘＝( )秒鐘",
        "answer": "138",
        "explain": "答案是 138。"
      },
      {
        "type": "fill",
        "prompt": "5分鐘35秒鐘＝( )秒鐘",
        "answer": "335",
        "explain": "答案是 335。"
      },
      {
        "type": "fill",
        "prompt": "媽媽煮一道菜要花3分鐘20秒鐘，也可以說是( )秒鐘。",
        "answer": "200",
        "explain": "答案是 200。"
      },
      {
        "type": "fill",
        "prompt": "從上午8時45分到上午9時45分，是經過了( )小時，也就是( )分鐘。",
        "answer": "1",
        "explain": "答案是 1，60。",
        "suffix": "，60"
      },
      {
        "type": "fill",
        "prompt": "韻如上午9時15分出門，上午11時15分到達火車站，共花了( )小時。",
        "answer": "2",
        "explain": "答案是 2。"
      },
      {
        "type": "fill",
        "prompt": "現在是上午10時39分，再過( )分鐘就是上午11時。",
        "answer": "21",
        "explain": "答案是 21。"
      },
      {
        "type": "fill",
        "prompt": "鐘面上有( )大格和( )小格。",
        "answer": "12",
        "explain": "答案是 12，60。",
        "suffix": "，60"
      },
      {
        "type": "fill",
        "prompt": "分針走5小格，秒針會走( )小格，也就是( )秒鐘。",
        "answer": "300",
        "explain": "答案是 300，300。",
        "suffix": "，300"
      },
      {
        "type": "fill",
        "prompt": "現在是6時54分57秒，再過3秒鐘，是( )時( )分( )秒。",
        "answer": "6",
        "explain": "答案是 6，55，0。",
        "suffix": "，55，0"
      },
      {
        "type": "fill",
        "prompt": "3分鐘38秒鐘＝( )秒鐘",
        "answer": "218",
        "explain": "答案是 218。"
      },
      {
        "type": "fill",
        "prompt": "4小時16分鐘＝( )分鐘",
        "answer": "256",
        "explain": "答案是 256。"
      },
      {
        "type": "fill",
        "prompt": "現在是上午9時12分，過28分鐘後是上午( )時( )分。",
        "answer": "9",
        "explain": "答案是 9，40。",
        "suffix": "，40"
      },
      {
        "type": "fill",
        "prompt": "從上午10時27分到下午3時32分，經過了( )小時( )分鐘。",
        "answer": "5",
        "explain": "答案是 5，5。",
        "suffix": "，5"
      },
      {
        "type": "fill",
        "prompt": "爸爸下午2：40開車從臺中出發，在17：40到高雄，共花了( )小時。",
        "answer": "3",
        "explain": "答案是 3。"
      },
      {
        "type": "fill",
        "prompt": "姐姐和妹妹去看電影，從下午5：30看到20：30，這部電影的片長是( )小時。",
        "answer": "3",
        "explain": "答案是 3。"
      },
      {
        "type": "fill",
        "prompt": "19：26再過2小時是什麼時刻？( ： )",
        "answer": "21",
        "explain": "答案是 21，26。",
        "suffix": "，26"
      },
      {
        "type": "fill",
        "prompt": "2小時43分鐘＝( )分鐘",
        "answer": "163",
        "explain": "答案是 163。"
      },
      {
        "type": "fill",
        "prompt": "3小時57分鐘＝( )分鐘",
        "answer": "237",
        "explain": "答案是 237。"
      },
      {
        "type": "fill",
        "prompt": "下午5時經過60分鐘後是下午( )時( )分。",
        "answer": "6",
        "explain": "答案是 6，0。",
        "suffix": "，0"
      },
      {
        "type": "fill",
        "prompt": "從上午11時到下午4時，是經過了( )小時。",
        "answer": "5",
        "explain": "答案是 5。"
      },
      {
        "type": "fill",
        "prompt": "從下午7時20分到下午9時20分，是經過了( )小時，也就是( )分鐘。",
        "answer": "2",
        "explain": "答案是 2，120。",
        "suffix": "，120"
      },
      {
        "type": "fill",
        "prompt": "從上午10時到下午5時，是經過了( )小時。",
        "answer": "7",
        "explain": "答案是 7。"
      },
      {
        "type": "fill",
        "prompt": "電影「叢林歷險」從21：00開始，到23：00結束，一共播了( )小時( )分鐘，也可以說是( )分鐘。",
        "answer": "2",
        "explain": "答案是 2，0，120。",
        "suffix": "，0，120"
      },
      {
        "type": "fill",
        "prompt": "現在是下午( )時( )分，再過23分鐘後，電影就要開演了，電影開演的時刻是下午( )時( )分。",
        "answer": "4",
        "explain": "答案是 4，26，4，49。",
        "suffix": "，26，4，49"
      },
      {
        "type": "fill",
        "prompt": "現在是上午，上一班公車在13分鐘前離開，上一班公車離站的時刻是( )時( )分。",
        "answer": "11",
        "explain": "答案是 11，27。",
        "suffix": "，27"
      },
      {
        "type": "fill",
        "prompt": "現在是( )時( )分，8分鐘前是( )時( )分。",
        "answer": "7",
        "explain": "答案是 7，24，7，16。",
        "suffix": "，24，7，16"
      },
      {
        "type": "fill",
        "prompt": "現在是( )時( )分，還差( )分鐘，就是10時50分。",
        "answer": "10",
        "explain": "答案是 10，18，32。",
        "suffix": "，18，32"
      },
      {
        "type": "fill",
        "prompt": "姐弟兩人去看舞臺劇，從3：30PM看到17：30，這齣舞臺劇的演出時間總共是( )小時。",
        "answer": "2",
        "explain": "答案是 2。"
      },
      {
        "type": "fill",
        "prompt": "上午10時58分經過2分鐘後，是上午( )時。",
        "answer": "11",
        "explain": "答案是 11。"
      },
      {
        "type": "fill",
        "prompt": "看時刻表回答問題。電影「鋼彈超人」(3D版)最早的一場是( )午( )時( )分。",
        "answer": "下，1，40",
        "explain": "答案是 下，1，40。"
      },
      {
        "type": "fill",
        "prompt": "看時刻表回答問題。兩部電影中，播放時間比較長的是( )。",
        "answer": "灰姑娘",
        "explain": "答案是 灰姑娘。"
      },
      {
        "type": "fill",
        "prompt": "看時刻表回答問題。婉芝在下午3時到達電影院，她最快可以看第( )場電影。",
        "answer": "三",
        "explain": "答案是 三。"
      },
      {
        "type": "fill",
        "prompt": "320秒鐘＝( )分鐘( )秒鐘",
        "answer": "5",
        "explain": "詳解：60×5＝300320－300＝20",
        "suffix": "，20"
      },
      {
        "type": "fill",
        "prompt": "弟弟學唱一首歌花了266秒鐘，也可以說是( )分鐘( )秒鐘。",
        "answer": "4",
        "explain": "詳解：60×4＝240266－240＝26",
        "suffix": "，26"
      },
      {
        "type": "fill",
        "prompt": "135分鐘＝( )小時( )分鐘",
        "answer": "2",
        "explain": "詳解：60×2＝120135－120＝15",
        "suffix": "，15"
      },
      {
        "type": "fill",
        "prompt": "206分鐘＝( )小時( )分鐘",
        "answer": "3",
        "explain": "詳解：60×3＝180206－180＝26",
        "suffix": "，26"
      },
      {
        "type": "fill",
        "prompt": "425秒鐘＝( )分鐘( )秒鐘",
        "answer": "7",
        "explain": "詳解：60×7＝420425－420＝5",
        "suffix": "，5"
      },
      {
        "type": "fill",
        "prompt": "看時刻表回答問題。叔叔上午10時打開電視，正在播放的節目是( )。",
        "answer": "健康人生",
        "explain": "答案是 健康人生。"
      },
      {
        "type": "fill",
        "prompt": "看時刻表回答問題。「歌曲之王」共播放( )小時。",
        "answer": "1",
        "explain": "答案是 1。"
      },
      {
        "type": "fill",
        "prompt": "看表回答問題。瑞瑞在下午2時51分坐上車次4726號列車，他是從什麼地方上車的？( )站",
        "answer": "嶺腳",
        "explain": "答案是 嶺腳。"
      },
      {
        "type": "fill",
        "prompt": "一天有24小時，一小時有60分鐘。一天中，時針和分針共轉了( )圈。",
        "answer": "26",
        "explain": "詳解：時針12小時轉1圈，一天轉2圈；分針每小時轉1圈，一天轉24圈，2＋24＝26"
      },
      {
        "type": "fill",
        "prompt": "一小時有60分鐘，一分鐘有60秒鐘。一小時中，分針和秒針共轉了( )圈。",
        "answer": "61",
        "explain": "詳解：分針1小時轉1圈；秒針每分鐘轉1圈，一小時有60分鐘，轉60圈，1＋60＝61"
      }
    ]
  }
};
